<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd"
>
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8"
>
<title></title>
<style type="text/css"
>
.ansi2html-content { display: inline; white-space: pre-wrap; word-wrap: break-word; }
.body_foreground { color: #AAAAAA; }
.body_background { background-color: #000000; }
.inv_foreground { color: #000000; }
.inv_background { background-color: #AAAAAA; }
.ansi1 { font-weight: bold; }
.ansi31 { color: #aa0000; }
.ansi32 { color: #00aa00; }
.ansi33 { color: #aa5500; }
.ansi36 { color: #00aaaa; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
</style>
</head>
<body class="body_foreground body_background" style="font-size: normal;" >
<pre class="ansi2html-content"
>
Script started on 2024-12-11 17:33:00-08:00 [COMMAND="timeout --preserve-status --foreground --signal=SIGTERM --kill-after=5s 40 swipl  /home/deb12user/metta-wam/prolog/metta_lang/metta_interp.pl -- --python=enable -- --timeout=40 --output=./reports/tests_output/baseline-compat/ --html --test tests/baseline_compat/hyperon-mettalog_sanity/type_filtering_tests.metta --halt=true  --stdin=tty --stdout=tty --stderr=tty" TERM="xterm" TTY="/dev/pts/2" COLUMNS="214" LINES="54"]
;           #(set_option_value compat false)
;           #(set_option_value compatio false)
;           #(set_option_value src_indents false)
;         #(set_option_value devel false)
;         #(set_option_value stack-max 500)
;         #(set_option_value limit inf)
;         #(set_option_value initial-result-count 10)
;         #(set_option_value answer-format show)
;         #(set_option_value repeats true)
;         #(set_option_value time true)
;         #(set_option_value synth-unit-tests false)
;         #(set_option_value optimize true)
;         #(set_option_value transpiler silent)
;          #(set_debug transpiler false)
;         #(set_option_value compile false)
;         #(set_option_value tabling auto)
;         #(set_option_value log false)
;         #(set_option_value output ./)
;         #(set_option_value exeout ./Sav.gitlab.MeTTaLog)
;         #(set_option_value halt false)
;         #(set_option_value trace-length 500)
;         #(set_option_value trace-on-overtime 4.0)
;          #(set_debug overtime 4.0)
;         #(set_option_value trace-on-overflow 1000)
;          #(set_debug overflow 1000)
;         #(set_option_value trace-on-eval false)
;          #(set_debug eval false)
;         #(set_option_value trace-on-load silent)
;          #(set_debug load silent)
;          #(set_debug trace-on-load false)
;         #(set_option_value trace-on-exec false)
;          #(set_debug exec false)
;         #(set_option_value trace-on-error non-type)
;          #(set_debug error non-type)
;         #(set_option_value trace-on-fail false)
;          #(set_debug fail false)
;         #(set_option_value trace-on-test true)
;          #(set_debug test true)
;         #(set_option_value repl-on-error true)
;         #(set_option_value repl-on-fail false)
;         #(set_option_value exit-on-fail false)
;         #(set_option_value repl auto)
;         #(set_option_value prolog false)
;         #(set_option_value exec noskip)
;         #(set_option_value maximum-result-count inf)
;         #(set_option_value html false)
;         #(set_option_value python true)
;         #(set_option_value trace-on-test false)
;         #(set_debug test false)
;         #(set_option_value trace-on-fail false)
;         #(set_debug fail false)
;         #(set_option_value load show)
;         #(set_option_value test false)
;          #(is_cmd_option prescan halt --halt=true true)
;          #(set_option_value halt true)
;          #(is_cmd_option prescan stdin --stdin=tty tty)
;           #(set_option_value stdin tty)
;          #(is_cmd_option prescan stdout --stdout=tty tty)
;           #(set_option_value stdout tty)
;          #(is_cmd_option prescan stderr --stderr=tty tty)
;           #(set_option_value stderr tty)
;          #(set_option_value compat false)
;          #(set_option_value compatio false)
;          #(set_option_value src_indents false)
;          #(set_option_value devel false)
;          #(set_option_value stack-max 500)
;          #(set_option_value limit inf)
;          #(set_option_value initial-result-count 10)
;          #(set_option_value answer-format show)
;          #(set_option_value repeats true)
;          #(set_option_value time true)
;          #(set_option_value synth-unit-tests false)
;          #(set_option_value optimize true)
;          #(set_option_value transpiler silent)
;          #(set_debug transpiler false)
;          #(set_option_value compile false)
;          #(set_option_value tabling auto)
;          #(set_option_value log false)
;          #(set_option_value output ./)
;          #(set_option_value exeout ./Sav.gitlab.MeTTaLog)
;          #(set_option_value halt false)
;          #(set_option_value trace-length 500)
;          #(set_option_value trace-on-overtime 4.0)
;          #(set_debug overtime 4.0)
;          #(set_option_value trace-on-overflow 1000)
;          #(set_debug overflow 1000)
;          #(set_option_value trace-on-eval false)
;          #(set_debug eval false)
;          #(set_option_value trace-on-load silent)
;          #(set_debug load silent)
;          #(set_debug trace-on-load false)
;          #(set_option_value trace-on-exec false)
;          #(set_debug exec false)
;          #(set_option_value trace-on-error non-type)
;          #(set_debug error non-type)
;          #(set_option_value trace-on-fail false)
;          #(set_debug fail false)
;          #(set_option_value trace-on-test true)
;          #(set_debug test true)
;          #(set_option_value repl-on-error true)
;          #(set_option_value repl-on-fail false)
;          #(set_option_value exit-on-fail false)
;          #(set_option_value repl auto)
;          #(set_option_value prolog false)
;          #(set_option_value exec noskip)
;          #(set_option_value maximum-result-count inf)
;          #(set_option_value html false)
;          #(set_option_value python true)
;         #(set_option_value trace-on-test false)
;          #(set_debug test false)
;         #(set_option_value trace-on-fail false)
;          #(set_debug fail false)
;         #(set_option_value load show)
;         #(set_option_value test true)
;        #(is_cmd_option execute python --python=enable enable)
;         #(set_option_value python enable)
;        #(is_cmd_option execute timeout --timeout=40 40)
;         #(set_option_value timeout 40)
;         #(is_cmd_option execute output --output=./reports/tests_output/baseline-compat/ ./reports/tests_output/baseline-compat/)
;         #(set_option_value output ./reports/tests_output/baseline-compat/)
;         #(is_cmd_option execute html --html true)
;          #(set_option_value html true)
;         #(is_cmd_option execute test --test true)
;          #(set_option_value test true)

; #( : user #(load_metta_file &self tests/baseline_compat/hyperon-mettalog_sanity/type_filtering_tests.metta) )
;                       #(track_load_into_file /home/deb12user/metta-wam/tests/baseline_compat/hyperon-mettalog_sanity/type_filtering_tests.metta)
;                                        #(load_answer_file /home/deb12user/metta-wam/tests/baseline_compat/hyperon-mettalog_sanity/type_filtering_tests.metta.answers /home/deb12user/metta-wam/tests/baseline_compat/hyperon-mettalog_sanity/type_filtering_tests.metta)
;                                         #( = 1 "" )
;                                         #( = 1 "     (MeTTa-Test \"Should be Passing\" (+ 1 1) " )
;                                         #( = 1 "        (2) " )
;                                         #( = 1 "        $passes)" )
;                                         #( = 1 "" )
;                                         #( = 1 "     (MeTTa-Test \"Filter-Number\" (Filter-Number (some-value)) " )
;                                         #( = 1 "       (1 5) " )
;                                         #( = 1 "       (1 $X#568 String 5 ()))" )
;                                         #( = 1 "" )
;                                         #( = 1 "     (MeTTa-Test \"passing\" (+ 1 1) " )
;                                         #( = 1 "        (2) " )
;                                         #( = 1 "        $passes)" )
;                                         #( = 1 "" )
;                                         #( = 1 "     (MeTTa-Test \"Filter-String\" (Filter-String (some-value)) " )
;                                         #( = 1 "       (\"a\" \"x: 1 y: 2\") " )
;                                         #( = 1 "       (\"a\" $X#1651 String () \"x: 1 y: 2\"))" )
;                                         #( = 1 "" )
;                                         #( = 1 "     (MeTTa-Test \"Filter-Nat\" (Filter-Nat (some-value)) " )
;                                         #( = 1 "       (Z (S Z) (S (S Z))) " )
;                                         #( = 1 "       ($X#2384 Z String (S (S Z)) () (S Z)))" )
;                                         #( = 1 "" )
;                                         #( = 1 "     (MeTTa-Test \"Filter-Symbol\" (Filter-Symbol (some-value)) " )
;                                         #( = 1 "       (S GroundingSpace-top) " )
;                                         #( = 1 "       ($X#4118 Z String S ()))" )
;                                         #( = 1 "" )
;                                         #( = 1 "     (MeTTa-Test \"Filter-Variable\" (Filter-Variable (some-value)) " )
;                                         #( = 1 "       (GroundingSpace-top) " )
;                                         #( = 1 "       ($X#4906 String ()))" )
;                                         #( = 1 "" )
;                                         #( = 1 "     (MeTTa-Test \"Filter-Grounded\" (Filter-Grounded (some-value)) " )
;                                         #( = 1 "       (1 \"a\" 'c' Z (S Z)) " )
;                                         #( = 1 "       ('c' 1 \"a\" $X#5600 String () \"x: 1 y: 2\"))" )
;                                         #( = 1 "" )
;                                         #( = 1 "     (MeTTa-Test \"Filter-Type\" (Filter-Type (some-value)) " )
;                                         #( = 1 "       (String) " )
;                                         #( = 1 "       ($X#6451 String ()))" )
;                                         #( = 1 "" )
;                                         #( = 1 "" )
;                                         #( = 1 "     (MeTTa-Test \"Filter-%Undefined%\" (Filter-%Undefined% (some-value)) " )
;                                         #( = 1 "       (all the values) " )
;                                         #( = 1 "       ('c' 1 \"a\" $X#7147 Z String S (S (S Z)) 5 () (Cons 1 (Cons 2 (Cons 3 Nil))) () \"x: 1 y: 2\" (S Z)))" )
;                                         #( = 1 "" )
;                                         #( = 1 "" )
;                                         #( = 1 "     (MeTTa-Test \"Filter-TVar\" (Filter-TVar (some-value)) " )
;                                         #( = 1 "       (1 \"a\" Z (S Z) (S (S Z))) " )
;                                         #( = 1 "       ('c' 1 \"a\" $X#10155 Z String S (S (S Z)) 5 () (Cons 1 (Cons 2 (Cons 3 Nil))) () \"x: 1 y: 2\" (S Z)))" )
;                                         #( = 1 "" )
;                                         #( = 1 "     (MeTTa-Test \"Filter-Undeclared\" (Filter-Undeclared (some-value)) " )
;                                         #( = 1 "       () " )
;                                         #( = 1 "       ($X#13419 String ()))" )
;                                         #( = 1 "" )
;                                         #( = 1 "" )
;                                         #( = 1 "     (MeTTa-Test \"Filter-Expression\" (Filter-Expression (some-value)) " )
;                                         #( = 1 "       ((+ 2 3) (format-args \"x: {} y: {}\" (1 2))) " )
;                                         #( = 1 "       ('c' 1 \"a\" $X#14110 Z String S (S (S Z)) 5 () (Cons 1 (Cons 2 (Cons 3 Nil))) () \"x: 1 y: 2\" (S Z)))" )
;                                         #( = 1 "" )
;                                         #( = 1 "" )
;                                         #( = 1 "     (MeTTa-Test \"Filter-Atom\" (Filter-Atom (some-value)) " )
;                                         #( = 1 "       (1 \"a\" 'c' S Z (S Z)) " )
;                                         #( = 1 "       ('c' 1 \"a\" $X#16854 Z String S (S (S Z)) 5 () (Cons 1 (Cons 2 (Cons 3 Nil))) () \"x: 1 y: 2\" (S Z)))" )
;                                         #( = 1 "" )
;                                         #( = 1 "" )
;                                         #( = 1 "     (MeTTa-Test \"Filter-ExpressionNumber\" (Filter-ExpressionNumber (some-value)) " )
;                                         #( = 1 "       ((+ 2 3)) " )
;                                         #( = 1 "       ('c' 1 \"a\" $X#19636 Z String S (S (S Z)) 5 () (Cons 1 (Cons 2 (Cons 3 Nil))) () \"x: 1 y: 2\" (S Z)))" )
;                                         #( = 1 "" )
;                                         #( = 1 "" )
;                                         #( = 1 "     (MeTTa-Test \"Filter-ExpressionUnit\" (Filter-ExpressionUnit (some-value)) " )
;                                         #( = 1 "       (empty (println! \"did it\")) " )
;                                         #( = 1 "       ('c' 1 \"a\" $X#22314 Z String S (S (S Z)) 5 () (Cons 1 (Cons 2 (Cons 3 Nil))) () \"x: 1 y: 2\" (S Z)))" )
;                                         #( = 1 "" )
;                                         #( = 1 "" )
;                                         #( = 1 "     (MeTTa-Test \"Filter-ExpressionAtom\" (Filter-ExpressionAtom (some-value)) " )
;                                         #( = 1 "       () " )
;                                         #( = 1 "       ('c' 1 \"a\" $X#25000 Z String S (S (S Z)) 5 () (Cons 1 (Cons 2 (Cons 3 Nil))) () \"x: 1 y: 2\" (S Z)))" )
;                                         #( = 1 "" )
;                                         #( = 1 "" )
;                                         #( = 1 "     (MeTTa-Test \"Filter-AtomAtom\" (Filter-AtomAtom (some-value)) " )
;                                         #( = 1 "       (Z String \"a\" 1 'c' $X S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) \"x: 1 y: 2\" (S (S Z)) ()) " )
;                                         #( = 1 "       ('c' 1 \"a\" $X#27662 Z String S (S (S Z)) 5 () (Cons 1 (Cons 2 (Cons 3 Nil))) () \"x: 1 y: 2\" (S Z)))" )
;                                         #( = 1 "" )
;                                         #( = 1 "     (MeTTa-Test \"Filter-Char\" (Filter-Char (some-value)) " )
;                                         #( = 1 "       ('c') " )
;                                         #( = 1 "       ('c' $X#31243 String ()))" )
;                                         #( = 1 "" )
;                                         #( = 1 "     (MeTTa-Test \"Filter-Empty\" (Filter-Empty (some-value)) " )
;                                         #( = 1 "       (empty (println! \"did it\") ()) " )
;                                         #( = 1 "       ($X#31961 String ()))" )
;                                         #( = 1 "" )
;                                         #( = 1 "     (MeTTa-Test \"Filter-List\" (Filter-List (some-value)) " )
;                                         #( = 1 "       ((Cons 1 (Cons 2 (Cons 3 Nil)))) " )
;                                         #( = 1 "       ($X#32697 String () (Cons 1 (Cons 2 (Cons 3 Nil)))))" )
;                                         #( = 1 "[()]" )
;                                         #( = 2 "[()]" )
;                                         #( = 3 "[()]" )
;                                         #( = 4 "[()]" )
;                                         #( = 5 "[()]" )
;                                         #( = 6 "[()]" )
;                                         #( = 7 "[()]" )
;                                         #( = 8 "[()]" )
;                                         #( = 9 "[()]" )
;                                         #( = 10 "[()]" )
;                                         #( = 11 "[()]" )
;                                         #( = 12 "[()]" )
;                                         #( = 13 "[()]" )
;                                         #( = 14 "[()]" )
;                                         #( = 15 "[()]" )
;                                         #( = 16 "[()]" )
;                                         #( = 17 "[()]" )
;                                         #( = 18 "[()]" )
;                                         #( = 19 "[()]" )
;                                         #( = 20 "[()]" )
;                                         #( = 21 "[()]" )
;                                         #( = 22 "0.30user 0.01system 0:00.32elapsed 96%CPU (0avgtext+0avgdata 27064maxresident)k" )
;                                         #( = 22 "0inputs+0outputs (0major+3513minor)pagefaults 0swaps" )
;                                        #(load_answer_file /home/deb12user/metta-wam/tests/baseline_compat/hyperon-mettalog_sanity/type_filtering_tests.metta.answers /home/deb12user/metta-wam/tests/baseline_compat/hyperon-mettalog_sanity/type_filtering_tests.metta)
;;;; Define Nat
<span class="ansi38-255165000"
> (: Nat Type)
</span><span class="ansi38-255165000"
> (: Z Nat)
</span><span class="ansi38-255165000"
> (: S (-> Nat Nat))
</span>;;;; Define List
<span class="ansi38-255165000"
> (: List (-> $a Type))
</span><span class="ansi38-255165000"
> (: Nil (List $a))
</span><span class="ansi38-255165000"
> (: Cons (-> $a (List $a) (List $a)))
</span>;;;; Define some-value returning various types
<span class="ansi38-255165000"
> (= (some-value)  1)
</span>;;; Number
<span class="ansi38-255165000"
> (= (some-value)  "a")
</span>;;; String
<span class="ansi38-255165000"
> (= (some-value)  'c')
</span>;;; Char
<span class="ansi38-255165000"
> (= (some-value)  $V)
</span>;;; Variable
<span class="ansi38-255165000"
> (= (some-value)  
  (Cons 1 
    (Cons 2 
      (Cons 3 Nil))))
</span>;;; Example List
<span class="ansi38-255165000"
> (= (some-value)  
  (+ 2 3))
</span>;;; Returns number  
<span class="ansi38-255165000"
> (= (some-value)  
  (println! ""))
</span>;;; Returns empty
<span class="ansi38-255165000"
> (= (some-value)  
  (empty))
</span>;;; Returns empty
<span class="ansi38-255165000"
> (= (some-value)  )
</span>;;; Empty Expression (not empty like teh tow above)
<span class="ansi38-255165000"
> (= (some-value)  
  (format-args "x: {} y: {}" 
    (1 2)))
</span>;;; Formatted string
<span class="ansi38-255165000"
> (= (some-value)  S)
</span>;;; Symbol (not a Nat)
<span class="ansi38-255165000"
> (= (some-value)  Z)
</span>;;; Nat
<span class="ansi38-255165000"
> (= (some-value)  
  (S Z))
</span>;;; Nat
<span class="ansi38-255165000"
> (= (some-value)  String)
</span>;;; Type
<span class="ansi38-255165000"
> (= (some-value)  
  (S (S Z)))
</span>;;; Nat
;;; (= (some-value) &self)                 ; Grounded Space
;;;; Filter definitions
<span class="ansi38-255165000"
> (: Filter-String (-> String $t))
</span><span class="ansi38-255165000"
> (: Filter-Number (-> Number $t))
</span><span class="ansi38-255165000"
> (: Filter-Nat (-> Nat $t))
</span><span class="ansi38-255165000"
> (: Filter-Symbol (-> Symbol $t))
</span><span class="ansi38-255165000"
> (: Filter-Variable (-> Variable $t))
</span><span class="ansi38-255165000"
> (: Filter-Grounded (-> Grounded $t))
</span><span class="ansi38-255165000"
> (: Filter-Type (-> Type $t))
</span><span class="ansi38-255165000"
> (: Filter-%Undefined% (-> %Undefined% $t))
</span><span class="ansi38-255165000"
> (: Filter-TVar (-> $t $t))
</span><span class="ansi38-255165000"
> (: Filter-Undeclared (-> Undeclared $t))
</span>;;; undeclared type
<span class="ansi38-255165000"
> (: Filter-Expression (-> Expression $t))
</span><span class="ansi38-255165000"
> (: Filter-Atom (-> Atom $t))
</span><span class="ansi38-255165000"
> (: Filter-ExpressionNumber (-> Expression Number))
</span><span class="ansi38-255165000"
> (: Filter-ExpressionUnit (-> Expression (->)))
</span><span class="ansi38-255165000"
> (: Filter-ExpressionAtom (-> Expression Atom))
</span><span class="ansi38-255165000"
> (: Filter-AtomAtom (-> Atom Atom))
</span><span class="ansi38-255165000"
> (: Filter-Char (-> Char $t))
</span><span class="ansi38-255165000"
> (: Filter-Empty (->  $t))
</span><span class="ansi38-255165000"
> (: Filter-List (-> (List $a) $t))
</span><span class="ansi38-255165000"
> (= (Filter-String $a)  $a)
</span><span class="ansi38-255165000"
> (= (Filter-Number $a)  $a)
</span><span class="ansi38-255165000"
> (= (Filter-Nat $a)  $a)
</span><span class="ansi38-255165000"
> (= (Filter-Symbol $a)  $a)
</span><span class="ansi38-255165000"
> (= (Filter-Variable $a)  $a)
</span><span class="ansi38-255165000"
> (= (Filter-Grounded $a)  $a)
</span><span class="ansi38-255165000"
> (= (Filter-Type $a)  $a)
</span><span class="ansi38-255165000"
> (= (Filter-%Undefined% $a)  $a)
</span><span class="ansi38-255165000"
> (= (Filter-TVar $a)  $a)
</span><span class="ansi38-255165000"
> (= (Filter-Undeclared $a)  $a)
</span><span class="ansi38-255165000"
> (= (Filter-Expression $a)  $a)
</span><span class="ansi38-255165000"
> (= (Filter-Atom $a)  $a)
</span><span class="ansi38-255165000"
> (= (Filter-ExpressionNumber $a)  $a)
</span><span class="ansi38-255165000"
> (= (Filter-ExpressionUnit $a)  $a)
</span><span class="ansi38-255165000"
> (= (Filter-ExpressionAtom $a)  $a)
</span><span class="ansi38-255165000"
> (= (Filter-AtomAtom $a)  $a)
</span><span class="ansi38-255165000"
> (= (Filter-Char $a)  $a)
</span><span class="ansi38-255165000"
> (= (Filter-Empty $a)  $a)
</span><span class="ansi38-255165000"
> (= (Filter-List $a)  $a)
</span><span class="ansi38-255165000"
> (: MeTTa-Test (-> String Atom Atom Atom Atom))
</span><span class="ansi38-255165000"
> (= (MeTTa-Test $Name $Form $List $passes)  
  (let 
    ($n $res $qform) 
    ($Name 
      (collapse $Form) 
      (quote $Form)) 
    (case $res 
      ( ($List (println! (format-args "\n     (MeTTa-Test \"{}\" {} \n        {} \n        {})" ($Name $Form $List $passes)))) ($10000 (println! (format-args "\n     (MeTTa-Test \"{}\" {} \n       {} \n       {})" ($Name $Form $List $res))))))))
</span><span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Should be Passing" (+ 1 1) (2) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Should be Passing" (+ 1 1) (2) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.01"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.01</h3>

     (MeTTa-Test "Should be Passing" 2 
        (2) 
        _34790)
; 
; EVAL TEST
; took 0.001 secs. (1.10 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Should be Passing" (+ 1 1) (2) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; returns of appropriate type
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Number" (Filter-Number (some-value)) (1 5) ($X 1 String () 5))
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Number" (Filter-Number (some-value)) (1 5) ($X 1 String () 5)) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.02"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.02</h3>

     (MeTTa-Test "Filter-Number" 1 
       (1 5) 
       (1))

     (MeTTa-Test "Filter-Number" a 
       (1 5) 
       ("a"))

     (MeTTa-Test "Filter-Number" c 
       (1 5) 
       ('c'))

     (MeTTa-Test "Filter-Number" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       (1 5) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-Number" 5 
       (1 5) 
       (5))

     (MeTTa-Test "Filter-Number" () 
       (1 5) 
       (()))

     (MeTTa-Test "Filter-Number" () 
       (1 5) 
       (()))

     (MeTTa-Test "Filter-Number" x: 1 y: 2 
       (1 5) 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-Number" S 
       (1 5) 
       (S))

     (MeTTa-Test "Filter-Number" Z 
       (1 5) 
       (Z))

     (MeTTa-Test "Filter-Number" (S Z) 
       (1 5) 
       ((S Z)))

     (MeTTa-Test "Filter-Number" String 
       (1 5) 
       (String))

     (MeTTa-Test "Filter-Number" (S (S Z)) 
       (1 5) 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.023 secs. (23.26 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Number" (Filter-Number (some-value)) (1 5) ($X 1 String () 5)) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; hyperon returns [1, String, (), 5]
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "passing" (+ 1 1) (2) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "passing" (+ 1 1) (2) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.03"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.03</h3>

     (MeTTa-Test "passing" 2 
        (2) 
        _791182)
; 
; EVAL TEST
; took 0.001 secs. (1.07 milliseconds) 

!(assertEqualToResult (MeTTa-Test "passing" (+ 1 1) (2) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span><span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-String" (Filter-String (some-value)) ("a" "x: 1 y: 2") $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-String" (Filter-String (some-value)) ("a" "x: 1 y: 2") $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.04"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.04</h3>

     (MeTTa-Test "Filter-String" 1 
       ("a" "x: 1 y: 2") 
       (1))

     (MeTTa-Test "Filter-String" a 
       ("a" "x: 1 y: 2") 
       ("a"))

     (MeTTa-Test "Filter-String" c 
       ("a" "x: 1 y: 2") 
       ('c'))

     (MeTTa-Test "Filter-String" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       ("a" "x: 1 y: 2") 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-String" 5 
       ("a" "x: 1 y: 2") 
       (5))

     (MeTTa-Test "Filter-String" () 
       ("a" "x: 1 y: 2") 
       (()))

     (MeTTa-Test "Filter-String" () 
       ("a" "x: 1 y: 2") 
       (()))

     (MeTTa-Test "Filter-String" x: 1 y: 2 
       ("a" "x: 1 y: 2") 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-String" S 
       ("a" "x: 1 y: 2") 
       (S))

     (MeTTa-Test "Filter-String" Z 
       ("a" "x: 1 y: 2") 
       (Z))

     (MeTTa-Test "Filter-String" (S Z) 
       ("a" "x: 1 y: 2") 
       ((S Z)))

     (MeTTa-Test "Filter-String" String 
       ("a" "x: 1 y: 2") 
       (String))

     (MeTTa-Test "Filter-String" (S (S Z)) 
       ("a" "x: 1 y: 2") 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.024 secs. (23.68 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-String" (Filter-String (some-value)) ("a" "x: 1 y: 2") $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; "a", String, "x: 1 y: 2", ()
;;;; Tests for Filter-Nat
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Nat" (Filter-Nat (some-value)) (Z (S Z) (S (S Z))) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Nat" (Filter-Nat (some-value)) (Z (S Z) (S (S Z))) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.05"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.05</h3>

     (MeTTa-Test "Filter-Nat" 1 
       (Z (S Z) (S (S Z))) 
       (1))

     (MeTTa-Test "Filter-Nat" a 
       (Z (S Z) (S (S Z))) 
       ("a"))

     (MeTTa-Test "Filter-Nat" c 
       (Z (S Z) (S (S Z))) 
       ('c'))

     (MeTTa-Test "Filter-Nat" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       (Z (S Z) (S (S Z))) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-Nat" 5 
       (Z (S Z) (S (S Z))) 
       (5))

     (MeTTa-Test "Filter-Nat" () 
       (Z (S Z) (S (S Z))) 
       (()))

     (MeTTa-Test "Filter-Nat" () 
       (Z (S Z) (S (S Z))) 
       (()))

     (MeTTa-Test "Filter-Nat" x: 1 y: 2 
       (Z (S Z) (S (S Z))) 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-Nat" S 
       (Z (S Z) (S (S Z))) 
       (S))

     (MeTTa-Test "Filter-Nat" Z 
       (Z (S Z) (S (S Z))) 
       (Z))

     (MeTTa-Test "Filter-Nat" (S Z) 
       (Z (S Z) (S (S Z))) 
       ((S Z)))

     (MeTTa-Test "Filter-Nat" String 
       (Z (S Z) (S (S Z))) 
       (String))

     (MeTTa-Test "Filter-Nat" (S (S Z)) 
       (Z (S Z) (S (S Z))) 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.028 secs. (27.95 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Nat" (Filter-Nat (some-value)) (Z (S Z) (S (S Z))) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-Symbol
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Symbol" (Filter-Symbol (some-value)) (S &self) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Symbol" (Filter-Symbol (some-value)) (S &self) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.06"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.06</h3>

     (MeTTa-Test "Filter-Symbol" 1 
       (S &self) 
       (1))

     (MeTTa-Test "Filter-Symbol" a 
       (S &self) 
       ("a"))

     (MeTTa-Test "Filter-Symbol" c 
       (S &self) 
       ('c'))

     (MeTTa-Test "Filter-Symbol" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       (S &self) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-Symbol" 5 
       (S &self) 
       (5))

     (MeTTa-Test "Filter-Symbol" () 
       (S &self) 
       (()))

     (MeTTa-Test "Filter-Symbol" () 
       (S &self) 
       (()))

     (MeTTa-Test "Filter-Symbol" x: 1 y: 2 
       (S &self) 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-Symbol" S 
       (S &self) 
       (S))

     (MeTTa-Test "Filter-Symbol" Z 
       (S &self) 
       (Z))

     (MeTTa-Test "Filter-Symbol" (S Z) 
       (S &self) 
       ((S Z)))

     (MeTTa-Test "Filter-Symbol" String 
       (S &self) 
       (String))

     (MeTTa-Test "Filter-Symbol" (S (S Z)) 
       (S &self) 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.022 secs. (22.39 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Symbol" (Filter-Symbol (some-value)) (S &self) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-Variable
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Variable" (Filter-Variable (some-value)) (&self) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Variable" (Filter-Variable (some-value)) (&self) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.07"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.07</h3>

     (MeTTa-Test "Filter-Variable" 1 
       (&self) 
       (1))

     (MeTTa-Test "Filter-Variable" a 
       (&self) 
       ("a"))

     (MeTTa-Test "Filter-Variable" c 
       (&self) 
       ('c'))

     (MeTTa-Test "Filter-Variable" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       (&self) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-Variable" 5 
       (&self) 
       (5))

     (MeTTa-Test "Filter-Variable" () 
       (&self) 
       (()))

     (MeTTa-Test "Filter-Variable" () 
       (&self) 
       (()))

     (MeTTa-Test "Filter-Variable" x: 1 y: 2 
       (&self) 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-Variable" S 
       (&self) 
       (S))

     (MeTTa-Test "Filter-Variable" Z 
       (&self) 
       (Z))

     (MeTTa-Test "Filter-Variable" (S Z) 
       (&self) 
       ((S Z)))

     (MeTTa-Test "Filter-Variable" String 
       (&self) 
       (String))

     (MeTTa-Test "Filter-Variable" (S (S Z)) 
       (&self) 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.023 secs. (22.55 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Variable" (Filter-Variable (some-value)) (&self) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Example case
;;;; Tests for Filter-Grounded
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Grounded" (Filter-Grounded (some-value)) (1 "a" 'c' Z (S Z)) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Grounded" (Filter-Grounded (some-value)) (1 "a" 'c' Z (S Z)) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.08"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.08</h3>

     (MeTTa-Test "Filter-Grounded" 1 
       (1 "a" 'c' Z (S Z)) 
       (1))

     (MeTTa-Test "Filter-Grounded" a 
       (1 "a" 'c' Z (S Z)) 
       ("a"))

     (MeTTa-Test "Filter-Grounded" c 
       (1 "a" 'c' Z (S Z)) 
       ('c'))

     (MeTTa-Test "Filter-Grounded" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       (1 "a" 'c' Z (S Z)) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-Grounded" 5 
       (1 "a" 'c' Z (S Z)) 
       (5))

     (MeTTa-Test "Filter-Grounded" () 
       (1 "a" 'c' Z (S Z)) 
       (()))

     (MeTTa-Test "Filter-Grounded" () 
       (1 "a" 'c' Z (S Z)) 
       (()))

     (MeTTa-Test "Filter-Grounded" x: 1 y: 2 
       (1 "a" 'c' Z (S Z)) 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-Grounded" S 
       (1 "a" 'c' Z (S Z)) 
       (S))

     (MeTTa-Test "Filter-Grounded" Z 
       (1 "a" 'c' Z (S Z)) 
       (Z))

     (MeTTa-Test "Filter-Grounded" (S Z) 
       (1 "a" 'c' Z (S Z)) 
       ((S Z)))

     (MeTTa-Test "Filter-Grounded" String 
       (1 "a" 'c' Z (S Z)) 
       (String))

     (MeTTa-Test "Filter-Grounded" (S (S Z)) 
       (1 "a" 'c' Z (S Z)) 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.027 secs. (26.89 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Grounded" (Filter-Grounded (some-value)) (1 "a" 'c' Z (S Z)) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-Type
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Type" (Filter-Type (some-value)) (String) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Type" (Filter-Type (some-value)) (String) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.09"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.09</h3>

     (MeTTa-Test "Filter-Type" 1 
       (String) 
       (1))

     (MeTTa-Test "Filter-Type" a 
       (String) 
       ("a"))

     (MeTTa-Test "Filter-Type" c 
       (String) 
       ('c'))

     (MeTTa-Test "Filter-Type" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       (String) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-Type" 5 
       (String) 
       (5))

     (MeTTa-Test "Filter-Type" () 
       (String) 
       (()))

     (MeTTa-Test "Filter-Type" () 
       (String) 
       (()))

     (MeTTa-Test "Filter-Type" x: 1 y: 2 
       (String) 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-Type" S 
       (String) 
       (S))

     (MeTTa-Test "Filter-Type" Z 
       (String) 
       (Z))

     (MeTTa-Test "Filter-Type" (S Z) 
       (String) 
       ((S Z)))

     (MeTTa-Test "Filter-Type" String 
        (String) 
        _649584)

     (MeTTa-Test "Filter-Type" (S (S Z)) 
       (String) 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.022 secs. (21.91 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Type" (Filter-Type (some-value)) (String) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-%Undefined%
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-%Undefined%" (Filter-%Undefined% (some-value)) (all the values) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-%Undefined%" (Filter-%Undefined% (some-value)) (all the values) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.10"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.10</h3>

     (MeTTa-Test "Filter-%Undefined%" 1 
       (all the values) 
       (1))

     (MeTTa-Test "Filter-%Undefined%" a 
       (all the values) 
       ("a"))

     (MeTTa-Test "Filter-%Undefined%" c 
       (all the values) 
       ('c'))

     (MeTTa-Test "Filter-%Undefined%" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       (all the values) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-%Undefined%" 5 
       (all the values) 
       (5))

     (MeTTa-Test "Filter-%Undefined%" () 
       (all the values) 
       (()))

     (MeTTa-Test "Filter-%Undefined%" () 
       (all the values) 
       (()))

     (MeTTa-Test "Filter-%Undefined%" x: 1 y: 2 
       (all the values) 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-%Undefined%" S 
       (all the values) 
       (S))

     (MeTTa-Test "Filter-%Undefined%" Z 
       (all the values) 
       (Z))

     (MeTTa-Test "Filter-%Undefined%" (S Z) 
       (all the values) 
       ((S Z)))

     (MeTTa-Test "Filter-%Undefined%" String 
       (all the values) 
       (String))

     (MeTTa-Test "Filter-%Undefined%" (S (S Z)) 
       (all the values) 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.023 secs. (22.70 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-%Undefined%" (Filter-%Undefined% (some-value)) (all the values) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-TVar
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-TVar" (Filter-TVar (some-value)) (1 "a" Z (S Z) (S (S Z))) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-TVar" (Filter-TVar (some-value)) (1 "a" Z (S Z) (S (S Z))) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.11"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.11</h3>

     (MeTTa-Test "Filter-TVar" 1 
       (1 "a" Z (S Z) (S (S Z))) 
       (1))

     (MeTTa-Test "Filter-TVar" a 
       (1 "a" Z (S Z) (S (S Z))) 
       ("a"))

     (MeTTa-Test "Filter-TVar" c 
       (1 "a" Z (S Z) (S (S Z))) 
       ('c'))

     (MeTTa-Test "Filter-TVar" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       (1 "a" Z (S Z) (S (S Z))) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-TVar" 5 
       (1 "a" Z (S Z) (S (S Z))) 
       (5))

     (MeTTa-Test "Filter-TVar" () 
       (1 "a" Z (S Z) (S (S Z))) 
       (()))

     (MeTTa-Test "Filter-TVar" () 
       (1 "a" Z (S Z) (S (S Z))) 
       (()))

     (MeTTa-Test "Filter-TVar" x: 1 y: 2 
       (1 "a" Z (S Z) (S (S Z))) 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-TVar" S 
       (1 "a" Z (S Z) (S (S Z))) 
       (S))

     (MeTTa-Test "Filter-TVar" Z 
       (1 "a" Z (S Z) (S (S Z))) 
       (Z))

     (MeTTa-Test "Filter-TVar" (S Z) 
       (1 "a" Z (S Z) (S (S Z))) 
       ((S Z)))

     (MeTTa-Test "Filter-TVar" String 
       (1 "a" Z (S Z) (S (S Z))) 
       (String))

     (MeTTa-Test "Filter-TVar" (S (S Z)) 
       (1 "a" Z (S Z) (S (S Z))) 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.032 secs. (32.40 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-TVar" (Filter-TVar (some-value)) (1 "a" Z (S Z) (S (S Z))) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-Undeclared
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Undeclared" (Filter-Undeclared (some-value)) () $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Undeclared" (Filter-Undeclared (some-value)) () $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.12"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.12</h3>

     (MeTTa-Test "Filter-Undeclared" 1 
       () 
       (1))

     (MeTTa-Test "Filter-Undeclared" a 
       () 
       ("a"))

     (MeTTa-Test "Filter-Undeclared" c 
       () 
       ('c'))

     (MeTTa-Test "Filter-Undeclared" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       () 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-Undeclared" 5 
       () 
       (5))

     (MeTTa-Test "Filter-Undeclared" () 
       () 
       (()))

     (MeTTa-Test "Filter-Undeclared" () 
       () 
       (()))

     (MeTTa-Test "Filter-Undeclared" x: 1 y: 2 
       () 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-Undeclared" S 
       () 
       (S))

     (MeTTa-Test "Filter-Undeclared" Z 
       () 
       (Z))

     (MeTTa-Test "Filter-Undeclared" (S Z) 
       () 
       ((S Z)))

     (MeTTa-Test "Filter-Undeclared" String 
       () 
       (String))

     (MeTTa-Test "Filter-Undeclared" (S (S Z)) 
       () 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.021 secs. (20.68 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Undeclared" (Filter-Undeclared (some-value)) () $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-Expression
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Expression" (Filter-Expression (some-value)) ((+ 2 3) (format-args "x: {} y: {}" (1 2))) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Expression" (Filter-Expression (some-value)) ((+ 2 3) (format-args "x: {} y: {}" (1 2))) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.13"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.13</h3>

     (MeTTa-Test "Filter-Expression" 1 
       (5 "x: 1 y: 2") 
       (1))

     (MeTTa-Test "Filter-Expression" a 
       (5 "x: 1 y: 2") 
       ("a"))

     (MeTTa-Test "Filter-Expression" c 
       (5 "x: 1 y: 2") 
       ('c'))

     (MeTTa-Test "Filter-Expression" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       (5 "x: 1 y: 2") 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-Expression" 5 
       (5 "x: 1 y: 2") 
       (5))

     (MeTTa-Test "Filter-Expression" () 
       (5 "x: 1 y: 2") 
       (()))

     (MeTTa-Test "Filter-Expression" () 
       (5 "x: 1 y: 2") 
       (()))

     (MeTTa-Test "Filter-Expression" x: 1 y: 2 
       (5 "x: 1 y: 2") 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-Expression" S 
       (5 "x: 1 y: 2") 
       (S))

     (MeTTa-Test "Filter-Expression" Z 
       (5 "x: 1 y: 2") 
       (Z))

     (MeTTa-Test "Filter-Expression" (S Z) 
       (5 "x: 1 y: 2") 
       ((S Z)))

     (MeTTa-Test "Filter-Expression" String 
       (5 "x: 1 y: 2") 
       (String))

     (MeTTa-Test "Filter-Expression" (S (S Z)) 
       (5 "x: 1 y: 2") 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.024 secs. (24.12 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Expression" (Filter-Expression (some-value)) ((+ 2 3) (format-args "x: {} y: {}" (1 2))) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-Atom
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Atom" (Filter-Atom (some-value)) (1 "a" 'c' S Z (S Z)) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Atom" (Filter-Atom (some-value)) (1 "a" 'c' S Z (S Z)) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.14"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.14</h3>

     (MeTTa-Test "Filter-Atom" 1 
       (1 "a" 'c' S Z (S Z)) 
       (1))

     (MeTTa-Test "Filter-Atom" a 
       (1 "a" 'c' S Z (S Z)) 
       ("a"))

     (MeTTa-Test "Filter-Atom" c 
       (1 "a" 'c' S Z (S Z)) 
       ('c'))

     (MeTTa-Test "Filter-Atom" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       (1 "a" 'c' S Z (S Z)) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-Atom" 5 
       (1 "a" 'c' S Z (S Z)) 
       (5))

     (MeTTa-Test "Filter-Atom" () 
       (1 "a" 'c' S Z (S Z)) 
       (()))

     (MeTTa-Test "Filter-Atom" () 
       (1 "a" 'c' S Z (S Z)) 
       (()))

     (MeTTa-Test "Filter-Atom" x: 1 y: 2 
       (1 "a" 'c' S Z (S Z)) 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-Atom" S 
       (1 "a" 'c' S Z (S Z)) 
       (S))

     (MeTTa-Test "Filter-Atom" Z 
       (1 "a" 'c' S Z (S Z)) 
       (Z))

     (MeTTa-Test "Filter-Atom" (S Z) 
       (1 "a" 'c' S Z (S Z)) 
       ((S Z)))

     (MeTTa-Test "Filter-Atom" String 
       (1 "a" 'c' S Z (S Z)) 
       (String))

     (MeTTa-Test "Filter-Atom" (S (S Z)) 
       (1 "a" 'c' S Z (S Z)) 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.027 secs. (26.86 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Atom" (Filter-Atom (some-value)) (1 "a" 'c' S Z (S Z)) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-ExpressionNumber
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-ExpressionNumber" (Filter-ExpressionNumber (some-value)) ((+ 2 3)) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-ExpressionNumber" (Filter-ExpressionNumber (some-value)) ((+ 2 3)) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.15"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.15</h3>

     (MeTTa-Test "Filter-ExpressionNumber" 1 
       (5) 
       (1))

     (MeTTa-Test "Filter-ExpressionNumber" a 
       (5) 
       ("a"))

     (MeTTa-Test "Filter-ExpressionNumber" c 
       (5) 
       ('c'))

     (MeTTa-Test "Filter-ExpressionNumber" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       (5) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-ExpressionNumber" 5 
        (5) 
        _539408)

     (MeTTa-Test "Filter-ExpressionNumber" () 
       (5) 
       (()))

     (MeTTa-Test "Filter-ExpressionNumber" () 
       (5) 
       (()))

     (MeTTa-Test "Filter-ExpressionNumber" x: 1 y: 2 
       (5) 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-ExpressionNumber" S 
       (5) 
       (S))

     (MeTTa-Test "Filter-ExpressionNumber" Z 
       (5) 
       (Z))

     (MeTTa-Test "Filter-ExpressionNumber" (S Z) 
       (5) 
       ((S Z)))

     (MeTTa-Test "Filter-ExpressionNumber" String 
       (5) 
       (String))

     (MeTTa-Test "Filter-ExpressionNumber" (S (S Z)) 
       (5) 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.022 secs. (22.01 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-ExpressionNumber" (Filter-ExpressionNumber (some-value)) ((+ 2 3)) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-ExpressionUnit
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-ExpressionUnit" (Filter-ExpressionUnit (some-value)) (empty (println! "did it")) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-ExpressionUnit" (Filter-ExpressionUnit (some-value)) (empty (println! "did it")) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.16"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.16</h3>
did it

     (MeTTa-Test "Filter-ExpressionUnit" 1 
       (empty ()) 
       (1))
did it

     (MeTTa-Test "Filter-ExpressionUnit" a 
       (empty ()) 
       ("a"))
did it

     (MeTTa-Test "Filter-ExpressionUnit" c 
       (empty ()) 
       ('c'))
did it

     (MeTTa-Test "Filter-ExpressionUnit" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       (empty ()) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))
did it

     (MeTTa-Test "Filter-ExpressionUnit" 5 
       (empty ()) 
       (5))
did it

     (MeTTa-Test "Filter-ExpressionUnit" () 
       (empty ()) 
       (()))
did it

     (MeTTa-Test "Filter-ExpressionUnit" () 
       (empty ()) 
       (()))
did it

     (MeTTa-Test "Filter-ExpressionUnit" x: 1 y: 2 
       (empty ()) 
       ("x: 1 y: 2"))
did it

     (MeTTa-Test "Filter-ExpressionUnit" S 
       (empty ()) 
       (S))
did it

     (MeTTa-Test "Filter-ExpressionUnit" Z 
       (empty ()) 
       (Z))
did it

     (MeTTa-Test "Filter-ExpressionUnit" (S Z) 
       (empty ()) 
       ((S Z)))
did it

     (MeTTa-Test "Filter-ExpressionUnit" String 
       (empty ()) 
       (String))
did it

     (MeTTa-Test "Filter-ExpressionUnit" (S (S Z)) 
       (empty ()) 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.025 secs. (24.84 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-ExpressionUnit" (Filter-ExpressionUnit (some-value)) (empty (println! "did it")) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-ExpressionAtom
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-ExpressionAtom" (Filter-ExpressionAtom (some-value)) () $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-ExpressionAtom" (Filter-ExpressionAtom (some-value)) () $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.17"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.17</h3>

     (MeTTa-Test "Filter-ExpressionAtom" 1 
       () 
       (1))

     (MeTTa-Test "Filter-ExpressionAtom" a 
       () 
       ("a"))

     (MeTTa-Test "Filter-ExpressionAtom" c 
       () 
       ('c'))

     (MeTTa-Test "Filter-ExpressionAtom" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       () 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-ExpressionAtom" 5 
       () 
       (5))

     (MeTTa-Test "Filter-ExpressionAtom" () 
       () 
       (()))

     (MeTTa-Test "Filter-ExpressionAtom" () 
       () 
       (()))

     (MeTTa-Test "Filter-ExpressionAtom" x: 1 y: 2 
       () 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-ExpressionAtom" S 
       () 
       (S))

     (MeTTa-Test "Filter-ExpressionAtom" Z 
       () 
       (Z))

     (MeTTa-Test "Filter-ExpressionAtom" (S Z) 
       () 
       ((S Z)))

     (MeTTa-Test "Filter-ExpressionAtom" String 
       () 
       (String))

     (MeTTa-Test "Filter-ExpressionAtom" (S (S Z)) 
       () 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.021 secs. (21.08 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-ExpressionAtom" (Filter-ExpressionAtom (some-value)) () $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-AtomAtom
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-AtomAtom" (Filter-AtomAtom (some-value)) (Z String "a" 1 'c' $X S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-AtomAtom" (Filter-AtomAtom (some-value)) (Z String "a" 1 'c' $X S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.18"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.18</h3>

     (MeTTa-Test "Filter-AtomAtom" 1 
       (Z String "a" 1 'c' $10000 S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) 
       (1))

     (MeTTa-Test "Filter-AtomAtom" a 
       (Z String "a" 1 'c' $10000 S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) 
       ("a"))

     (MeTTa-Test "Filter-AtomAtom" c 
       (Z String "a" 1 'c' $10000 S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) 
       ('c'))

     (MeTTa-Test "Filter-AtomAtom" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       (Z String "a" 1 'c' $10000 S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-AtomAtom" 5 
       (Z String "a" 1 'c' $10000 S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) 
       (5))

     (MeTTa-Test "Filter-AtomAtom" () 
       (Z String "a" 1 'c' $10000 S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) 
       (()))

     (MeTTa-Test "Filter-AtomAtom" () 
       (Z String "a" 1 'c' $10000 S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) 
       (()))

     (MeTTa-Test "Filter-AtomAtom" x: 1 y: 2 
       (Z String "a" 1 'c' $10000 S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-AtomAtom" S 
       (Z String "a" 1 'c' $10000 S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) 
       (S))

     (MeTTa-Test "Filter-AtomAtom" Z 
       (Z String "a" 1 'c' $10000 S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) 
       (Z))

     (MeTTa-Test "Filter-AtomAtom" (S Z) 
       (Z String "a" 1 'c' $10000 S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) 
       ((S Z)))

     (MeTTa-Test "Filter-AtomAtom" String 
       (Z String "a" 1 'c' $10000 S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) 
       (String))

     (MeTTa-Test "Filter-AtomAtom" (S (S Z)) 
       (Z String "a" 1 'c' $10000 S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.070 secs. (69.78 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-AtomAtom" (Filter-AtomAtom (some-value)) (Z String "a" 1 'c' $X S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-Char
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Char" (Filter-Char (some-value)) ('c') $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Char" (Filter-Char (some-value)) ('c') $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.19"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.19</h3>

     (MeTTa-Test "Filter-Char" 1 
       ('c') 
       (1))

     (MeTTa-Test "Filter-Char" a 
       ('c') 
       ("a"))

     (MeTTa-Test "Filter-Char" c 
        ('c') 
        _197326)

     (MeTTa-Test "Filter-Char" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       ('c') 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-Char" 5 
       ('c') 
       (5))

     (MeTTa-Test "Filter-Char" () 
       ('c') 
       (()))

     (MeTTa-Test "Filter-Char" () 
       ('c') 
       (()))

     (MeTTa-Test "Filter-Char" x: 1 y: 2 
       ('c') 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-Char" S 
       ('c') 
       (S))

     (MeTTa-Test "Filter-Char" Z 
       ('c') 
       (Z))

     (MeTTa-Test "Filter-Char" (S Z) 
       ('c') 
       ((S Z)))

     (MeTTa-Test "Filter-Char" String 
       ('c') 
       (String))

     (MeTTa-Test "Filter-Char" (S (S Z)) 
       ('c') 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.022 secs. (22.42 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Char" (Filter-Char (some-value)) ('c') $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-Empty
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Empty" (Filter-Empty (some-value)) (empty (println! "did it") ()) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Empty" (Filter-Empty (some-value)) (empty (println! "did it") ()) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.20"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.20</h3>
did it

     (MeTTa-Test "Filter-Empty" 1 
       (empty () ()) 
       (1))
did it

     (MeTTa-Test "Filter-Empty" a 
       (empty () ()) 
       ("a"))
did it

     (MeTTa-Test "Filter-Empty" c 
       (empty () ()) 
       ('c'))
did it

     (MeTTa-Test "Filter-Empty" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       (empty () ()) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))
did it

     (MeTTa-Test "Filter-Empty" 5 
       (empty () ()) 
       (5))
did it

     (MeTTa-Test "Filter-Empty" () 
       (empty () ()) 
       (()))
did it

     (MeTTa-Test "Filter-Empty" () 
       (empty () ()) 
       (()))
did it

     (MeTTa-Test "Filter-Empty" x: 1 y: 2 
       (empty () ()) 
       ("x: 1 y: 2"))
did it

     (MeTTa-Test "Filter-Empty" S 
       (empty () ()) 
       (S))
did it

     (MeTTa-Test "Filter-Empty" Z 
       (empty () ()) 
       (Z))
did it

     (MeTTa-Test "Filter-Empty" (S Z) 
       (empty () ()) 
       ((S Z)))
did it

     (MeTTa-Test "Filter-Empty" String 
       (empty () ()) 
       (String))
did it

     (MeTTa-Test "Filter-Empty" (S (S Z)) 
       (empty () ()) 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.025 secs. (24.77 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Empty" (Filter-Empty (some-value)) (empty (println! "did it") ()) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-List
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-List" (Filter-List (some-value)) ((Cons 1 (Cons 2 (Cons 3 Nil)))) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-List" (Filter-List (some-value)) ((Cons 1 (Cons 2 (Cons 3 Nil)))) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.21"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.21</h3>

     (MeTTa-Test "Filter-List" 1 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))) 
       (1))

     (MeTTa-Test "Filter-List" a 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))) 
       ("a"))

     (MeTTa-Test "Filter-List" c 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))) 
       ('c'))

     (MeTTa-Test "Filter-List" (Cons 1 (Cons 2 (Cons 3 Nil))) 
        ((Cons 1 (Cons 2 (Cons 3 Nil)))) 
        _751054)

     (MeTTa-Test "Filter-List" 5 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))) 
       (5))

     (MeTTa-Test "Filter-List" () 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))) 
       (()))

     (MeTTa-Test "Filter-List" () 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))) 
       (()))

     (MeTTa-Test "Filter-List" x: 1 y: 2 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))) 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-List" S 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))) 
       (S))

     (MeTTa-Test "Filter-List" Z 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))) 
       (Z))

     (MeTTa-Test "Filter-List" (S Z) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))) 
       ((S Z)))

     (MeTTa-Test "Filter-List" String 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))) 
       (String))

     (MeTTa-Test "Filter-List" (S (S Z)) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))) 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.029 secs. (28.68 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-List" (Filter-List (some-value)) ((Cons 1 (Cons 2 (Cons 3 Nil)))) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span><span class="ansi32"
>% 6,938,052 inferences, 0.646 CPU in 0.647 seconds (100% CPU, 10732620 Lips)
</span>;                       #( = /home/deb12user/metta-wam/tests/baseline_compat/hyperon-mettalog_sanity/type_filtering_tests.metta 0 )
<span class="ansi1"
>LoonIt Report
</span>------------
<span class="ansi32"
>Successes: 21
</span><span class="ansi32"
>Failures: 0
</span><br/> <a href="#" onclick="window.history.back(); return false;"
>Return to summaries</a><br/>
;         #(is_cmd_option execute halt --halt=true true)
;          #(set_option_value halt true)
;          #(is_cmd_option execute stdin --stdin=tty tty)
;          #(set_option_value stdin tty)
;          #(is_cmd_option execute stdout --stdout=tty tty)
;           #(set_option_value stdout tty)
;          #(is_cmd_option execute stderr --stderr=tty tty)
;           #(set_option_value stderr tty)
;         #(set_option_value compat false)
;         #(set_option_value compatio false)
;         #(set_option_value src_indents false)
;         #(set_option_value devel false)
;         #(set_option_value stack-max 500)
;         #(set_option_value limit inf)
;         #(set_option_value initial-result-count 10)
;         #(set_option_value answer-format show)
;         #(set_option_value repeats true)
;         #(set_option_value time true)
;         #(set_option_value synth-unit-tests false)
;         #(set_option_value optimize true)
;         #(set_option_value transpiler silent)
;          #(set_debug transpiler false)
;         #(set_option_value compile false)
;         #(set_option_value tabling auto)
;         #(set_option_value log false)
;         #(set_option_value output ./)
;         #(set_option_value exeout ./Sav.gitlab.MeTTaLog)
;         #(set_option_value halt false)
;         #(set_option_value trace-length 500)
;         #(set_option_value trace-on-overtime 4.0)
;          #(set_debug overtime 4.0)
;         #(set_option_value trace-on-overflow 1000)
;          #(set_debug overflow 1000)
;         #(set_option_value trace-on-eval false)
;          #(set_debug eval false)
;         #(set_option_value trace-on-load silent)
;          #(set_debug load silent)
;          #(set_debug trace-on-load false)
;         #(set_option_value trace-on-exec false)
;          #(set_debug exec false)
;         #(set_option_value trace-on-error non-type)
;          #(set_debug error non-type)
;         #(set_option_value trace-on-fail false)
;          #(set_debug fail false)
;         #(set_option_value trace-on-test true)
;          #(set_debug test true)
;         #(set_option_value repl-on-error true)
;         #(set_option_value repl-on-fail false)
;         #(set_option_value exit-on-fail false)
;         #(set_option_value repl auto)
;         #(set_option_value prolog false)
;         #(set_option_value exec noskip)
;         #(set_option_value maximum-result-count inf)
;         #(set_option_value html false)
;         #(set_option_value python true)
;         #(set_option_value trace-on-test false)
;          #(set_debug test false)
;         #(set_option_value trace-on-fail false)
;          #(set_debug fail false)
;         #(set_option_value load show)
;         #(set_option_value test true)

[()]

[()]

[()]

[()]

[()]

[()]

[()]

[()]

[()]

[()]

[()]

[()]

[()]

[()]

[()]

[()]

[()]

[()]

[()]

[()]

[()]
;         #(maybe_halt 7)
<span class="ansi31"
>#(in #(maybe_halt 7) #(unwind #(halt 7)))
</span>
Script done on 2024-12-11 17:33:04-08:00 [COMMAND_EXIT_CODE="7"]

</pre>
</body>

</html>
\033[0;32mCompleted successfully (EXITCODE=7) Under 40 seconds: ./mettalog '--output=./reports/tests_output/baseline-compat/' --timeout=40 --html --repl=false  --test "tests/baseline_compat/hyperon-mettalog_sanity/type_filtering_tests.metta" --halt=true\033[0m
