<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd"
>
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8"
>
<title></title>
<style type="text/css"
>
.ansi2html-content { display: inline; white-space: pre-wrap; word-wrap: break-word; }
.body_foreground { color: #AAAAAA; }
.body_background { background-color: #000000; }
.inv_foreground { color: #000000; }
.inv_background { background-color: #AAAAAA; }
.ansi1 { font-weight: bold; }
.ansi32 { color: #00aa00; }
.ansi33 { color: #aa5500; }
.ansi36 { color: #00aaaa; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
</style>
</head>
<body class="body_foreground body_background" style="font-size: normal;" >
<pre class="ansi2html-content"
>
Script started on 2025-02-18 05:55:55+00:00 [COMMAND="timeout --preserve-status --foreground 40 swipl -x /home/runner/work/metta-testsuite/metta-testsuite/prolog/metta_lang/Sav.fv-az1950-383.MeTTaLog   -- --python=enable -- --timeout=40 --output=/home/runner/work/metta-testsuite/metta-testsuite/reports/tests_output/baseline-compat --html --test tests/baseline_compat/hyperon-mettalog_sanity/type_filtering_tests.metta --halt=true  --stdin=tty --stdout=tty --stderr=tty" TERM="xterm-256color" TTY="/dev/pts/0" COLUMNS="-1" LINES="-1"]

; [ : user [load_metta_file &self tests/baseline_compat/hyperon-mettalog_sanity/type_filtering_tests.metta] ]
P;HTML|
;               [track_load_into_file /home/runner/work/metta-testsuite/metta-testsuite/tests/baseline_compat/hyperon-mettalog_sanity/type_filtering_tests.metta]
P;HTML|
;                      [load_answer_file /home/runner/work/metta-testsuite/metta-testsuite/tests/baseline_compat/hyperon-mettalog_sanity/type_filtering_tests.metta.answers /home/runner/work/metta-testsuite/metta-testsuite/tests/baseline_compat/hyperon-mettalog_sanity/type_filtering_tests.metta]
P;HTML|
;                       [ = 1 "" ]
P;HTML|
;                       [ = 1 "     (MeTTa-Test \"Should be Passing\" (+ 1 1) " ]
P;HTML|
;                       [ = 1 "        (2) " ]
P;HTML|
;                        [ = 1 "        $passes)" ]
P;HTML|
;                        [ = 1 "" ]
P;HTML|
;                         [ = 1 "     (MeTTa-Test \"Filter-Number\" (Filter-Number (some-value)) " ]
P;HTML|
;                         [ = 1 "       (1 5) " ]
P;HTML|
;                         [ = 1 "       ($X#568 1 String 5 ()))" ]
P;HTML|
;                          [ = 1 "" ]
P;HTML|
;                          [ = 1 "     (MeTTa-Test \"passing\" (+ 1 1) " ]
P;HTML|
;                           [ = 1 "        (2) " ]
P;HTML|
;                           [ = 1 "        $passes)" ]
P;HTML|
;                           [ = 1 "" ]
P;HTML|
;                            [ = 1 "     (MeTTa-Test \"Filter-String\" (Filter-String (some-value)) " ]
P;HTML|
;                            [ = 1 "       (\"a\" \"x: 1 y: 2\") " ]
P;HTML|
;                             [ = 1 "       (\"a\" $X#1651 String \"x: 1 y: 2\" ()))" ]
P;HTML|
;                             [ = 1 "" ]
P;HTML|
;                             [ = 1 "     (MeTTa-Test \"Filter-Nat\" (Filter-Nat (some-value)) " ]
P;HTML|
;                              [ = 1 "       (Z (S Z) (S (S Z))) " ]
P;HTML|
;                              [ = 1 "       ($X#2384 String Z (S (S Z)) (S Z) ()))" ]
P;HTML|
;                               [ = 1 "" ]
P;HTML|
;                               [ = 1 "     (MeTTa-Test \"Filter-Symbol\" (Filter-Symbol (some-value)) " ]
P;HTML|
;                               [ = 1 "       (S GroundingSpace-top) " ]
P;HTML|
;                                [ = 1 "       ($X#4118 S String Z ()))" ]
P;HTML|
;                                [ = 1 "" ]
P;HTML|
;                                 [ = 1 "     (MeTTa-Test \"Filter-Variable\" (Filter-Variable (some-value)) " ]
P;HTML|
;                                 [ = 1 "       (GroundingSpace-top) " ]
P;HTML|
;                                 [ = 1 "       ($X#4906 String ()))" ]
P;HTML|
;                                  [ = 1 "" ]
P;HTML|
;                                  [ = 1 "     (MeTTa-Test \"Filter-Grounded\" (Filter-Grounded (some-value)) " ]
P;HTML|
;                                   [ = 1 "       (1 \"a\" 'c' Z (S Z)) " ]
P;HTML|
;                                   [ = 1 "       ('c' \"a\" $X#5600 1 String \"x: 1 y: 2\" ()))" ]
P;HTML|
;                                   [ = 1 "" ]
P;HTML|
;                                    [ = 1 "     (MeTTa-Test \"Filter-Type\" (Filter-Type (some-value)) " ]
P;HTML|
;                                    [ = 1 "       (String) " ]
P;HTML|
;                                     [ = 1 "       ($X#6451 String ()))" ]
P;HTML|
;                                     [ = 1 "" ]
P;HTML|
;                                     [ = 1 "" ]
P;HTML|
;                                      [ = 1 "     (MeTTa-Test \"Filter-%Undefined%\" (Filter-%Undefined% (some-value)) " ]
P;HTML|
;                                      [ = 1 "       (all the values) " ]
P;HTML|
;                                       [ = 1 "       ('c' \"a\" $X#7147 1 S String Z \"x: 1 y: 2\" 5 (S (S Z)) (S Z) () (Cons 1 (Cons 2 (Cons 3 Nil))) ()))" ]
P;HTML|
;                                       [ = 1 "" ]
P;HTML|
;                                       [ = 1 "" ]
P;HTML|
;                                        [ = 1 "     (MeTTa-Test \"Filter-TVar\" (Filter-TVar (some-value)) " ]
P;HTML|
;                                        [ = 1 "       (1 \"a\" Z (S Z) (S (S Z))) " ]
P;HTML|
;                                         [ = 1 "       ('c' \"a\" $X#10155 1 S String Z \"x: 1 y: 2\" 5 (S (S Z)) (S Z) () (Cons 1 (Cons 2 (Cons 3 Nil))) ()))" ]
P;HTML|
;                                         [ = 1 "" ]
P;HTML|
;                                         [ = 1 "     (MeTTa-Test \"Filter-Undeclared\" (Filter-Undeclared (some-value)) " ]
P;HTML|
;                                         [ = 1 "       () " ]
P;HTML|
;                                         [ = 1 "       ($X#13419 String ()))" ]
P;HTML|
;                                         [ = 1 "" ]
P;HTML|
;                                         [ = 1 "" ]
P;HTML|
;                                         [ = 1 "     (MeTTa-Test \"Filter-Expression\" (Filter-Expression (some-value)) " ]
P;HTML|
;                                         [ = 1 "       ((+ 2 3) (format-args \"x: {} y: {}\" (1 2))) " ]
P;HTML|
;                                         [ = 1 "       ('c' \"a\" $X#14110 1 S String Z \"x: 1 y: 2\" 5 (S (S Z)) (S Z) () (Cons 1 (Cons 2 (Cons 3 Nil))) ()))" ]
P;HTML|
;                                         [ = 1 "" ]
P;HTML|
;                                         [ = 1 "" ]
P;HTML|
;                                         [ = 1 "     (MeTTa-Test \"Filter-Atom\" (Filter-Atom (some-value)) " ]
P;HTML|
;                                         [ = 1 "       (1 \"a\" 'c' S Z (S Z)) " ]
P;HTML|
;                                         [ = 1 "       ('c' \"a\" $X#16854 1 S String Z \"x: 1 y: 2\" 5 (S (S Z)) (S Z) () (Cons 1 (Cons 2 (Cons 3 Nil))) ()))" ]
P;HTML|
;                                         [ = 1 "" ]
P;HTML|
;                                         [ = 1 "" ]
P;HTML|
;                                         [ = 1 "     (MeTTa-Test \"Filter-ExpressionNumber\" (Filter-ExpressionNumber (some-value)) " ]
P;HTML|
;                                         [ = 1 "       ((+ 2 3)) " ]
P;HTML|
;                                         [ = 1 "       ('c' \"a\" $X#19636 1 S String Z \"x: 1 y: 2\" 5 (S (S Z)) (S Z) () (Cons 1 (Cons 2 (Cons 3 Nil))) ()))" ]
P;HTML|
;                                         [ = 1 "" ]
P;HTML|
;                                         [ = 1 "" ]
P;HTML|
;                                         [ = 1 "     (MeTTa-Test \"Filter-ExpressionUnit\" (Filter-ExpressionUnit (some-value)) " ]
P;HTML|
;                                         [ = 1 "       (empty (println! \"did it\")) " ]
P;HTML|
;                                         [ = 1 "       ('c' \"a\" $X#22314 1 S String Z \"x: 1 y: 2\" 5 (S (S Z)) (S Z) () (Cons 1 (Cons 2 (Cons 3 Nil))) ()))" ]
P;HTML|
;                                         [ = 1 "" ]
P;HTML|
;                                         [ = 1 "" ]
P;HTML|
;                                         [ = 1 "     (MeTTa-Test \"Filter-ExpressionAtom\" (Filter-ExpressionAtom (some-value)) " ]
P;HTML|
;                                         [ = 1 "       () " ]
P;HTML|
;                                         [ = 1 "       ('c' \"a\" $X#25000 1 S String Z \"x: 1 y: 2\" 5 (S (S Z)) (S Z) () (Cons 1 (Cons 2 (Cons 3 Nil))) ()))" ]
P;HTML|
;                                         [ = 1 "" ]
P;HTML|
;                                         [ = 1 "" ]
P;HTML|
;                                         [ = 1 "     (MeTTa-Test \"Filter-AtomAtom\" (Filter-AtomAtom (some-value)) " ]
P;HTML|
;                                         [ = 1 "       (Z String \"a\" 1 'c' $X S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) \"x: 1 y: 2\" (S (S Z)) ()) " ]
P;HTML|
;                                         [ = 1 "       ('c' \"a\" $X#27662 1 S String Z \"x: 1 y: 2\" 5 (S (S Z)) (S Z) () (Cons 1 (Cons 2 (Cons 3 Nil))) ()))" ]
P;HTML|
;                                         [ = 1 "" ]
P;HTML|
;                                         [ = 1 "     (MeTTa-Test \"Filter-Char\" (Filter-Char (some-value)) " ]
P;HTML|
;                                         [ = 1 "       ('c') " ]
P;HTML|
;                                         [ = 1 "       ('c' $X#31243 String ()))" ]
P;HTML|
;                                         [ = 1 "" ]
P;HTML|
;                                         [ = 1 "     (MeTTa-Test \"Filter-Empty\" (Filter-Empty (some-value)) " ]
P;HTML|
;                                         [ = 1 "       (empty (println! \"did it\") ()) " ]
P;HTML|
;                                         [ = 1 "       ($X#31961 String ()))" ]
P;HTML|
;                                         [ = 1 "" ]
P;HTML|
;                                         [ = 1 "     (MeTTa-Test \"Filter-List\" (Filter-List (some-value)) " ]
P;HTML|
;                                         [ = 1 "       ((Cons 1 (Cons 2 (Cons 3 Nil)))) " ]
P;HTML|
;                                         [ = 1 "       ($X#32697 String (Cons 1 (Cons 2 (Cons 3 Nil))) ()))" ]
P;HTML|
;                                         [ = 1 "[()]" ]
P;HTML|
;                                         [ = 2 "[()]" ]
P;HTML|
;                                         [ = 3 "[()]" ]
P;HTML|
;                                         [ = 4 "[()]" ]
P;HTML|
;                                         [ = 5 "[()]" ]
P;HTML|
;                                         [ = 6 "[()]" ]
P;HTML|
;                                         [ = 7 "[()]" ]
P;HTML|
;                                         [ = 8 "[()]" ]
P;HTML|
;                                         [ = 9 "[()]" ]
P;HTML|
;                                         [ = 10 "[()]" ]
P;HTML|
;                                         [ = 11 "[()]" ]
P;HTML|
;                                         [ = 12 "[()]" ]
P;HTML|
;                                         [ = 13 "[()]" ]
P;HTML|
;                                         [ = 14 "[()]" ]
P;HTML|
;                                         [ = 15 "[()]" ]
P;HTML|
;                                         [ = 16 "[()]" ]
P;HTML|
;                                         [ = 17 "[()]" ]
P;HTML|
;                                         [ = 18 "[()]" ]
P;HTML|
;                                         [ = 19 "[()]" ]
P;HTML|
;                                         [ = 20 "[()]" ]
P;HTML|
;                                         [ = 21 "[()]" ]
P;HTML|
;                      [load_answer_file /home/runner/work/metta-testsuite/metta-testsuite/tests/baseline_compat/hyperon-mettalog_sanity/type_filtering_tests.metta.answers /home/runner/work/metta-testsuite/metta-testsuite/tests/baseline_compat/hyperon-mettalog_sanity/type_filtering_tests.metta]

;;;; Define Nat
<span class="ansi38-255165000"
> (: Nat Type)
</span><span class="ansi38-255165000"
> (: Z Nat)
</span><span class="ansi38-255165000"
> (: S (-> Nat Nat))
</span>;;;; Define List
<span class="ansi38-255165000"
> (: List (-> $_57958 Type))
</span><span class="ansi38-255165000"
> (: Nil (List $_61276))
</span><span class="ansi38-255165000"
> (: Cons (-> $_2442 (List $_2442) (List $_2442)))
</span>;;;; Define some-value returning various types
<span class="ansi38-255165000"
> (= (some-value)  1)
</span>;;; Number
<span class="ansi38-255165000"
> (= (some-value)  "a")
</span>;;; String
<span class="ansi38-255165000"
> (= (some-value)  'c')
</span>;;; Char
<span class="ansi38-255165000"
> (= (some-value)  $_14096)
</span>;;; Variable
<span class="ansi38-255165000"
> (= (some-value)  
  (Cons 1 
    (Cons 2 
      (Cons 3 Nil))))
</span>;;; Example List
<span class="ansi38-255165000"
> (= (some-value)  
  (+ 2 3))
</span>;;; Returns number  
<span class="ansi38-255165000"
> (= (some-value)  
  (println! ""))
</span>;;; Returns empty
<span class="ansi38-255165000"
> (= (some-value)  
  (empty))
</span>;;; Returns empty
<span class="ansi38-255165000"
> (= (some-value)  )
</span>;;; Empty Expression (not empty like teh tow above)
<span class="ansi38-255165000"
> (= (some-value)  
  (format-args "x: {} y: {}" 
    (1 2)))
</span>;;; Formatted string
<span class="ansi38-255165000"
> (= (some-value)  S)
</span>;;; Symbol (not a Nat)
<span class="ansi38-255165000"
> (= (some-value)  Z)
</span>;;; Nat
<span class="ansi38-255165000"
> (= (some-value)  
  (S Z))
</span>;;; Nat
<span class="ansi38-255165000"
> (= (some-value)  String)
</span>;;; Type
<span class="ansi38-255165000"
> (= (some-value)  
  (S (S Z)))
</span>;;; Nat
;;; (= (some-value) &self)                 ; Grounded Space
;;;; Filter definitions
<span class="ansi38-255165000"
> (: Filter-String (-> String $_46578))
</span><span class="ansi38-255165000"
> (: Filter-Number (-> Number $_49916))
</span><span class="ansi38-255165000"
> (: Filter-Nat (-> Nat $_53254))
</span><span class="ansi38-255165000"
> (: Filter-Symbol (-> Symbol $_56592))
</span><span class="ansi38-255165000"
> (: Filter-Variable (-> Variable $_59930))
</span><span class="ansi38-255165000"
> (: Filter-Grounded (-> Grounded $_63270))
</span><span class="ansi38-255165000"
> (: Filter-Type (-> Type $_3072))
</span><span class="ansi38-255165000"
> (: Filter-%Undefined% (-> %Undefined% $_6410))
</span><span class="ansi38-255165000"
> (: Filter-TVar (-> $_9746 $_9746))
</span><span class="ansi38-255165000"
> (: Filter-Undeclared (-> Undeclared $_13090))
</span>;;; undeclared type
<span class="ansi38-255165000"
> (: Filter-Expression (-> Expression $_16430))
</span><span class="ansi38-255165000"
> (: Filter-Atom (-> Atom $_19770))
</span><span class="ansi38-255165000"
> (: Filter-ExpressionNumber (-> Expression Number))
</span><span class="ansi38-255165000"
> (: Filter-ExpressionUnit (-> Expression (->)))
</span><span class="ansi38-255165000"
> (: Filter-ExpressionAtom (-> Expression Atom))
</span><span class="ansi38-255165000"
> (: Filter-AtomAtom (-> Atom Atom))
</span><span class="ansi38-255165000"
> (: Filter-Char (-> Char $_34990))
</span><span class="ansi38-255165000"
> (: Filter-Empty (-> Empty $_38328))
</span><span class="ansi38-255165000"
> (: Filter-List (-> (List $_42068) $_42074))
</span><span class="ansi38-255165000"
> (= (Filter-String $_45312)  $_45312)
</span><span class="ansi38-255165000"
> (= (Filter-Number $_48620)  $_48620)
</span><span class="ansi38-255165000"
> (= (Filter-Nat $_51928)  $_51928)
</span><span class="ansi38-255165000"
> (= (Filter-Symbol $_55236)  $_55236)
</span><span class="ansi38-255165000"
> (= (Filter-Variable $_58544)  $_58544)
</span><span class="ansi38-255165000"
> (= (Filter-Grounded $_61854)  $_61854)
</span><span class="ansi38-255165000"
> (= (Filter-Type $_2338)  $_2338)
</span><span class="ansi38-255165000"
> (= (Filter-%Undefined% $_6166)  $_6166)
</span><span class="ansi38-255165000"
> (= (Filter-TVar $_9476)  $_9476)
</span><span class="ansi38-255165000"
> (= (Filter-Undeclared $_12784)  $_12784)
</span><span class="ansi38-255165000"
> (= (Filter-Expression $_16094)  $_16094)
</span><span class="ansi38-255165000"
> (= (Filter-Atom $_19404)  $_19404)
</span><span class="ansi38-255165000"
> (= (Filter-ExpressionNumber $_22712)  $_22712)
</span><span class="ansi38-255165000"
> (= (Filter-ExpressionUnit $_26024)  $_26024)
</span><span class="ansi38-255165000"
> (= (Filter-ExpressionAtom $_29334)  $_29334)
</span><span class="ansi38-255165000"
> (= (Filter-AtomAtom $_32644)  $_32644)
</span><span class="ansi38-255165000"
> (= (Filter-Char $_35954)  $_35954)
</span><span class="ansi38-255165000"
> (= (Filter-Empty $_39262)  $_39262)
</span><span class="ansi38-255165000"
> (= (Filter-List $_42570)  $_42570)
</span><span class="ansi38-255165000"
> (: MeTTa-Test (-> String Atom Atom Atom Atom))
</span><span class="ansi38-255165000"
> (= (MeTTa-Test $_51716 $_51722 $_51728 $_51734)  
  (let 
    (= $_51764  $_51770) 
    (= (collapse $_51722)  
      (quote $_51722)) 
    (case $_51764 
      ( ($_51728 (println! (format-args "\n     (MeTTa-Test \"{}\" {} \n        {} \n        {})" (= $_51722 $_51728 $_51734)))) ($_51926 (println! (format-args "\n     (MeTTa-Test \"{}\" {} \n       {} \n       {})" (= $_51722 $_51728 $_51764))))))))
</span><span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Should be Passing" (+ 1 1) (2) $_54402)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Should be Passing" (+ 1 1) (2) $_56752) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.01"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.01</h3>

     (MeTTa-Test "Should be Passing" (+ 1 1) 
        (2) 
        $_27066)
; 
; EVAL TEST
; took 0.004 secs. (3.70 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Should be Passing" (+ 1 1) (2) $_28078) (()))

<span class="ansi36"
>  [loonit_success 
    [equal_enough_for_test_renumbered_l strict_equals_allow_vn 
      (()) 
      (())]]
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; returns of appropriate type
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Number" (Filter-Number (some-value)) (1 5) ($_40078 1 String () 5))
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Number" (Filter-Number (some-value)) (1 5) ($_42448 1 String () 5)) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.02"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.02</h3>

     (MeTTa-Test "Filter-Number" (Filter-Number (some-value)) 
       (1 5) 
       (1))
; 
; EVAL TEST
; took 0.003 secs. (3.32 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Number" (Filter-Number (some-value)) (1 5) ($_21982 1 String () 5)) (()))

<span class="ansi36"
>  [loonit_success 
    [equal_enough_for_test_renumbered_l strict_equals_allow_vn 
      (()) 
      (())]]
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; hyperon returns [1, String, (), 5]
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "passing" (+ 1 1) (2) $_33864)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "passing" (+ 1 1) (2) $_36210) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.03"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.03</h3>

     (MeTTa-Test "passing" (+ 1 1) 
        (2) 
        $_9278)
; 
; EVAL TEST
; took 0.003 secs. (3.41 milliseconds) 

!(assertEqualToResult (MeTTa-Test "passing" (+ 1 1) (2) $_10286) (()))

<span class="ansi36"
>  [loonit_success 
    [equal_enough_for_test_renumbered_l strict_equals_allow_vn 
      (()) 
      (())]]
</span>
Deterministic: <span class="ansi33"
>()
</span><span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-String" (Filter-String (some-value)) ("a" "x: 1 y: 2") $_22270)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-String" (Filter-String (some-value)) ("a" "x: 1 y: 2") $_24636) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.04"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.04</h3>

     (MeTTa-Test "Filter-String" (Filter-String (some-value)) 
       ("a" "x: 1 y: 2") 
       (1))
; 
; EVAL TEST
; took 0.003 secs. (3.02 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-String" (Filter-String (some-value)) ("a" "x: 1 y: 2") $_57050) (()))

<span class="ansi36"
>  [loonit_success 
    [equal_enough_for_test_renumbered_l strict_equals_allow_vn 
      (()) 
      (())]]
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; "a", String, "x: 1 y: 2", ()
;;;; Tests for Filter-Nat
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Nat" (Filter-Nat (some-value)) (Z (S Z) (S (S Z))) $_6648)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Nat" (Filter-Nat (some-value)) (Z (S Z) (S (S Z))) $_9012) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.05"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.05</h3>

     (MeTTa-Test "Filter-Nat" (Filter-Nat (some-value)) 
       (Z (S Z) (S (S Z))) 
       (1))
; 
; EVAL TEST
; took 0.003 secs. (3.13 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Nat" (Filter-Nat (some-value)) (Z (S Z) (S (S Z))) $_42780) (()))

<span class="ansi36"
>  [loonit_success 
    [equal_enough_for_test_renumbered_l strict_equals_allow_vn 
      (()) 
      (())]]
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-Symbol
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Symbol" (Filter-Symbol (some-value)) (S &self) $_54674)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Symbol" (Filter-Symbol (some-value)) (S &self) $_57036) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.06"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.06</h3>

     (MeTTa-Test "Filter-Symbol" (Filter-Symbol (some-value)) 
       (S &self) 
       (1))
; 
; EVAL TEST
; took 0.003 secs. (3.15 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Symbol" (Filter-Symbol (some-value)) (S &self) $_28416) (()))

<span class="ansi36"
>  [loonit_success 
    [equal_enough_for_test_renumbered_l strict_equals_allow_vn 
      (()) 
      (())]]
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-Variable
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Variable" (Filter-Variable (some-value)) (&self) $_40340)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Variable" (Filter-Variable (some-value)) (&self) $_42702) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.07"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.07</h3>

     (MeTTa-Test "Filter-Variable" (Filter-Variable (some-value)) 
       (&self) 
       (1))
; 
; EVAL TEST
; took 0.003 secs. (3.15 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Variable" (Filter-Variable (some-value)) (&self) $_21450) (()))

<span class="ansi36"
>  [loonit_success 
    [equal_enough_for_test_renumbered_l strict_equals_allow_vn 
      (()) 
      (())]]
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Example case
;;;; Tests for Filter-Grounded
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Grounded" (Filter-Grounded (some-value)) (1 "a" 'c' Z (S Z)) $_33516)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Grounded" (Filter-Grounded (some-value)) (1 "a" 'c' Z (S Z)) $_35886) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.08"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.08</h3>

     (MeTTa-Test "Filter-Grounded" (Filter-Grounded (some-value)) 
       (1 "a" 'c' Z (S Z)) 
       (1))
; 
; EVAL TEST
; took 0.003 secs. (3.24 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Grounded" (Filter-Grounded (some-value)) (1 "a" 'c' Z (S Z)) $_11262) (()))

<span class="ansi36"
>  [loonit_success 
    [equal_enough_for_test_renumbered_l strict_equals_allow_vn 
      (()) 
      (())]]
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-Type
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Type" (Filter-Type (some-value)) (String) $_23138)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Type" (Filter-Type (some-value)) (String) $_25498) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.09"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.09</h3>

     (MeTTa-Test "Filter-Type" (Filter-Type (some-value)) 
       (String) 
       (1))
; 
; EVAL TEST
; took 0.003 secs. (2.99 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Type" (Filter-Type (some-value)) (String) $_57780) (()))

<span class="ansi36"
>  [loonit_success 
    [equal_enough_for_test_renumbered_l strict_equals_allow_vn 
      (()) 
      (())]]
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-%Undefined%
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-%Undefined%" (Filter-%Undefined% (some-value)) (all the values) $_7314)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-%Undefined%" (Filter-%Undefined% (some-value)) (all the values) $_9684) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.10"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.10</h3>

     (MeTTa-Test "Filter-%Undefined%" (Filter-%Undefined% (some-value)) 
       (all the values) 
       (1 "a" 'c' (Cons 1 (Cons 2 (Cons 3 Nil))) 5 () () "x: 1 y: 2" S Z (S Z) String (S (S Z))))
; 
; EVAL TEST
; took 0.035 secs. (34.72 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-%Undefined%" (Filter-%Undefined% (some-value)) (all the values) $_35888) (()))

<span class="ansi36"
>  [loonit_success 
    [equal_enough_for_test_renumbered_l strict_equals_allow_vn 
      (()) 
      (())]]
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-TVar
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-TVar" (Filter-TVar (some-value)) (1 "a" Z (S Z) (S (S Z))) $_47996)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-TVar" (Filter-TVar (some-value)) (1 "a" Z (S Z) (S (S Z))) $_50366) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.11"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.11</h3>

     (MeTTa-Test "Filter-TVar" (Filter-TVar (some-value)) 
       (1 "a" Z (S Z) (S (S Z))) 
       (1))
; 
; EVAL TEST
; took 0.003 secs. (3.32 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-TVar" (Filter-TVar (some-value)) (1 "a" Z (S Z) (S (S Z))) $_25972) (()))

<span class="ansi36"
>  [loonit_success 
    [equal_enough_for_test_renumbered_l strict_equals_allow_vn 
      (()) 
      (())]]
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-Undeclared
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Undeclared" (Filter-Undeclared (some-value)) () $_37818)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Undeclared" (Filter-Undeclared (some-value)) () $_40180) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.12"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.12</h3>

     (MeTTa-Test "Filter-Undeclared" (Filter-Undeclared (some-value)) 
       () 
       (1))
; 
; EVAL TEST
; took 0.003 secs. (3.17 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Undeclared" (Filter-Undeclared (some-value)) () $_13190) (()))

<span class="ansi36"
>  [loonit_success 
    [equal_enough_for_test_renumbered_l strict_equals_allow_vn 
      (()) 
      (())]]
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-Expression
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Expression" (Filter-Expression (some-value)) ((+ 2 3) (format-args "x: {} y: {}" (1 2))) $_25310)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Expression" (Filter-Expression (some-value)) ((+ 2 3) (format-args "x: {} y: {}" (1 2))) $_27692) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.13"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.13</h3>

     (MeTTa-Test "Filter-Expression" (Filter-Expression (some-value)) 
       ((+ 2 3) (format-args "x: {} y: {}" (1 2))) 
       (1 "a" 'c' (Cons 1 (Cons 2 (Cons 3 Nil))) 5 () () "x: 1 y: 2" S Z (S Z) String (S (S Z))))
; 
; EVAL TEST
; took 0.035 secs. (34.56 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Expression" (Filter-Expression (some-value)) ((+ 2 3) (format-args "x: {} y: {}" (1 2))) $_58626) (()))

<span class="ansi36"
>  [loonit_success 
    [equal_enough_for_test_renumbered_l strict_equals_allow_vn 
      (()) 
      (())]]
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-Atom
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Atom" (Filter-Atom (some-value)) (1 "a" 'c' S Z (S Z)) $_15628)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Atom" (Filter-Atom (some-value)) (1 "a" 'c' S Z (S Z)) $_17994) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.14"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.14</h3>

     (MeTTa-Test "Filter-Atom" (Filter-Atom (some-value)) 
       (1 "a" 'c' S Z (S Z)) 
       (1 "a" 'c' (Cons 1 (Cons 2 (Cons 3 Nil))) 5 () () "x: 1 y: 2" S Z (S Z) String (S (S Z))))
; 
; EVAL TEST
; took 0.035 secs. (34.62 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Atom" (Filter-Atom (some-value)) (1 "a" 'c' S Z (S Z)) $_46548) (()))

<span class="ansi36"
>  [loonit_success 
    [equal_enough_for_test_renumbered_l strict_equals_allow_vn 
      (()) 
      (())]]
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-ExpressionNumber
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-ExpressionNumber" (Filter-ExpressionNumber (some-value)) ((+ 2 3)) $_58486)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-ExpressionNumber" (Filter-ExpressionNumber (some-value)) ((+ 2 3)) $_60860) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.15"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.15</h3>

     (MeTTa-Test "Filter-ExpressionNumber" (Filter-ExpressionNumber (some-value)) 
       ((+ 2 3)) 
       (1 "a" 'c' (Cons 1 (Cons 2 (Cons 3 Nil))) 5 () () "x: 1 y: 2" S Z (S Z) String (S (S Z))))
; 
; EVAL TEST
; took 0.034 secs. (33.60 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-ExpressionNumber" (Filter-ExpressionNumber (some-value)) ((+ 2 3)) $_20900) (()))

<span class="ansi36"
>  [loonit_success 
    [equal_enough_for_test_renumbered_l strict_equals_allow_vn 
      (()) 
      (())]]
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-ExpressionUnit
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-ExpressionUnit" (Filter-ExpressionUnit (some-value)) (empty (println! "did it")) $_32880)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-ExpressionUnit" (Filter-ExpressionUnit (some-value)) (empty (println! "did it")) $_35258) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.16"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.16</h3>

     (MeTTa-Test "Filter-ExpressionUnit" (Filter-ExpressionUnit (some-value)) 
       (empty (println! "did it")) 
       (1 "a" 'c' (Cons 1 (Cons 2 (Cons 3 Nil))) 5 () () "x: 1 y: 2" S Z (S Z) String (S (S Z))))
; 
; EVAL TEST
; took 0.033 secs. (33.44 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-ExpressionUnit" (Filter-ExpressionUnit (some-value)) (empty (println! "did it")) $_59708) (()))

<span class="ansi36"
>  [loonit_success 
    [equal_enough_for_test_renumbered_l strict_equals_allow_vn 
      (()) 
      (())]]
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-ExpressionAtom
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-ExpressionAtom" (Filter-ExpressionAtom (some-value)) () $_15152)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-ExpressionAtom" (Filter-ExpressionAtom (some-value)) () $_17518) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.17"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.17</h3>

     (MeTTa-Test "Filter-ExpressionAtom" (Filter-ExpressionAtom (some-value)) 
       () 
       (1 "a" 'c' (Cons 1 (Cons 2 (Cons 3 Nil))) 5 () () "x: 1 y: 2" S Z (S Z) String (S (S Z))))
; 
; EVAL TEST
; took 0.033 secs. (33.16 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-ExpressionAtom" (Filter-ExpressionAtom (some-value)) () $_37272) (()))

<span class="ansi36"
>  [loonit_success 
    [equal_enough_for_test_renumbered_l strict_equals_allow_vn 
      (()) 
      (())]]
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-AtomAtom
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-AtomAtom" (Filter-AtomAtom (some-value)) (Z String "a" 1 'c' $_50148 S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) $_50154)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-AtomAtom" (Filter-AtomAtom (some-value)) (Z String "a" 1 'c' $_52558 S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) $_52564) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.18"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.18</h3>

     (MeTTa-Test "Filter-AtomAtom" (Filter-AtomAtom (some-value)) 
       (Z String "a" 1 'c' $_32744 S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) 
       (1 "a" 'c' (Cons 1 (Cons 2 (Cons 3 Nil))) 5 () () "x: 1 y: 2" S Z (S Z) String (S (S Z))))
; 
; EVAL TEST
; took 0.035 secs. (35.01 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-AtomAtom" (Filter-AtomAtom (some-value)) (Z String "a" 1 'c' $_33182 S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) $_33188) (()))

<span class="ansi36"
>  [loonit_success 
    [equal_enough_for_test_renumbered_l strict_equals_allow_vn 
      (()) 
      (())]]
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-Char
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Char" (Filter-Char (some-value)) ('c') $_44870)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Char" (Filter-Char (some-value)) ('c') $_47228) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.19"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.19</h3>

     (MeTTa-Test "Filter-Char" (Filter-Char (some-value)) 
       ('c') 
       (1))
; 
; EVAL TEST
; took 0.003 secs. (3.15 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Char" (Filter-Char (some-value)) ('c') $_21524) (()))

<span class="ansi36"
>  [loonit_success 
    [equal_enough_for_test_renumbered_l strict_equals_allow_vn 
      (()) 
      (())]]
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-Empty
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Empty" (Filter-Empty (some-value)) (empty (println! "did it") ()) $_33534)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Empty" (Filter-Empty (some-value)) (empty (println! "did it") ()) $_35906) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.20"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.20</h3>

     (MeTTa-Test "Filter-Empty" (Filter-Empty (some-value)) 
       (empty (println! "did it") ()) 
       (1))
; 
; EVAL TEST
; took 0.003 secs. (3.20 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Empty" (Filter-Empty (some-value)) (empty (println! "did it") ()) $_10908) (()))

<span class="ansi36"
>  [loonit_success 
    [equal_enough_for_test_renumbered_l strict_equals_allow_vn 
      (()) 
      (())]]
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-List
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-List" (Filter-List (some-value)) ((Cons 1 (Cons 2 (Cons 3 Nil)))) $_22964)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-List" (Filter-List (some-value)) ((Cons 1 (Cons 2 (Cons 3 Nil)))) $_25336) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.21"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.21</h3>

     (MeTTa-Test "Filter-List" (Filter-List (some-value)) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))) 
       (1))
; 
; EVAL TEST
; took 0.003 secs. (3.12 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-List" (Filter-List (some-value)) ((Cons 1 (Cons 2 (Cons 3 Nil)))) $_59280) (()))

<span class="ansi36"
>  [loonit_success 
    [equal_enough_for_test_renumbered_l strict_equals_allow_vn 
      (()) 
      (())]]
</span>
Deterministic: <span class="ansi33"
>()
</span>P;HTML|
;               [ = /home/runner/work/metta-testsuite/metta-testsuite/tests/baseline_compat/hyperon-mettalog_sanity/type_filtering_tests.metta 0 ]
<span class="ansi1"
>LoonIt Report
</span>------------
<span class="ansi32"
>Successes: 21
</span><span class="ansi32"
>Failures: 0
</span><br/> <a href="#" onclick="window.history.back(); return false;"
>Return to summaries</a><br/>
[()]
[()]
[()]
[()]
[()]
[()]
[()]
[()]
[()]
[()]
[()]
[()]
[()]
[()]
[()]
[()]
[()]
[()]
[()]
[()]
[()]

Script done on 2025-02-18 05:55:57+00:00 [COMMAND_EXIT_CODE="7"]

</pre>
</body>

</html>
\033[0;32mCompleted successfully (EXITCODE=7) Under 40 seconds: /home/runner/work/metta-testsuite/metta-testsuite/mettalog '--output=/home/runner/work/metta-testsuite/metta-testsuite/reports/tests_output/baseline-compat' --timeout=40 --html --repl=false  --test "tests/baseline_compat/hyperon-mettalog_sanity/type_filtering_tests.metta" --halt=true\033[0m
