<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd"
>
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8"
>
<title></title>
<style type="text/css"
>
.ansi2html-content { display: inline; white-space: pre-wrap; word-wrap: break-word; }
.body_foreground { color: #AAAAAA; }
.body_background { background-color: #000000; }
.inv_foreground { color: #000000; }
.inv_background { background-color: #AAAAAA; }
.ansi1 { font-weight: bold; }
.ansi31 { color: #aa0000; }
.ansi32 { color: #00aa00; }
.ansi33 { color: #aa5500; }
.ansi36 { color: #00aaaa; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165000 { color: #FFA500; }
.ansi38-255165005 { color: #FFA505; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
.ansi38-255165009 { color: #FFA509; }
.ansi38-255238088 { color: #FFEE58; }
.ansi38-013099040 { color: #0D6328; }
</style>
</head>
<body class="body_foreground body_background" style="font-size: normal;" >
<pre class="ansi2html-content"
>
Script started on 2024-12-26 10:53:00+00:00 [COMMAND="timeout --preserve-status --foreground --signal=SIGTERM --kill-after=5s 40 swipl  /home/runner/work/metta-testsuite/metta-testsuite/prolog/metta_lang/metta_interp.pl -- --python=enable -- --timeout=40 --output=./reports/tests_output/baseline-compat/ --html --test tests/baseline_compat/hyperon-mettalog_sanity/type_filtering_tests.metta --halt=true  --stdin=tty --stdout=tty --stderr=tty" TERM="xterm-256color" TTY="/dev/pts/0" COLUMNS="-1" LINES="-1"]
P;HTML|
;         #(set_debug transpiler false)

P;HTML|
;          #(set_debug overtime 4.0)

P;HTML|
;          #(set_debug overflow 1000)

P;HTML|
;          #(set_debug eval false)

P;HTML|
;          #(set_debug load silent)

P;HTML|
;          #(set_debug trace-on-load false)

P;HTML|
;          #(set_debug exec false)

P;HTML|
;          #(set_debug error non-type)

P;HTML|
;          #(set_debug fail false)

P;HTML|
;          #(set_debug test true)

P;HTML|
;         #(set_debug test false)

P;HTML|
;         #(set_debug fail false)
P;HTML|
;          #(set_debug transpiler false)
P;HTML|
;          #(set_debug overtime 4.0)
P;HTML|
;          #(set_debug overflow 1000)
P;HTML|
;          #(set_debug eval false)
P;HTML|
;          #(set_debug load silent)
P;HTML|
;          #(set_debug trace-on-load false)
P;HTML|
;          #(set_debug exec false)
P;HTML|
;          #(set_debug error non-type)
P;HTML|
;          #(set_debug fail false)
P;HTML|
;          #(set_debug test true)
P;HTML|
;          #(set_debug test false)
P;HTML|
;          #(set_debug fail false)

; #( : user #(load_metta_file &self tests/baseline_compat/hyperon-mettalog_sanity/type_filtering_tests.metta) )
P;HTML|
;                #(track_load_into_file /home/runner/work/metta-testsuite/metta-testsuite/tests/baseline_compat/hyperon-mettalog_sanity/type_filtering_tests.metta)
P;HTML|
;                       #(load_answer_file /home/runner/work/metta-testsuite/metta-testsuite/tests/baseline_compat/hyperon-mettalog_sanity/type_filtering_tests.metta.answers /home/runner/work/metta-testsuite/metta-testsuite/tests/baseline_compat/hyperon-mettalog_sanity/type_filtering_tests.metta)
P;HTML|
;                        #( = 1 "" )
P;HTML|
;                        #( = 1 "     (MeTTa-Test \"Should be Passing\" (+ 1 1) " )
P;HTML|
;                         #( = 1 "        (2) " )
P;HTML|
;                         #( = 1 "        $passes)" )
P;HTML|
;                          #( = 1 "" )
P;HTML|
;                          #( = 1 "     (MeTTa-Test \"Filter-Number\" (Filter-Number (some-value)) " )
P;HTML|
;                          #( = 1 "       (1 5) " )
P;HTML|
;                           #( = 1 "       (String $X#568 1 () 5))" )
P;HTML|
;                           #( = 1 "" )
P;HTML|
;                            #( = 1 "     (MeTTa-Test \"passing\" (+ 1 1) " )
P;HTML|
;                            #( = 1 "        (2) " )
P;HTML|
;                            #( = 1 "        $passes)" )
P;HTML|
;                             #( = 1 "" )
P;HTML|
;                             #( = 1 "     (MeTTa-Test \"Filter-String\" (Filter-String (some-value)) " )
P;HTML|
;                              #( = 1 "       (\"a\" \"x: 1 y: 2\") " )
P;HTML|
;                              #( = 1 "       (String \"a\" $X#1657 () \"x: 1 y: 2\"))" )
P;HTML|
;                              #( = 1 "" )
P;HTML|
;                               #( = 1 "     (MeTTa-Test \"Filter-Nat\" (Filter-Nat (some-value)) " )
P;HTML|
;                               #( = 1 "       (Z (S Z) (S (S Z))) " )
P;HTML|
;                                #( = 1 "       (String $X#2396 Z () (S (S Z)) (S Z)))" )
P;HTML|
;                                #( = 1 "" )
P;HTML|
;                                #( = 1 "     (MeTTa-Test \"Filter-Symbol\" (Filter-Symbol (some-value)) " )
P;HTML|
;                                 #( = 1 "       (S GroundingSpace-top) " )
P;HTML|
;                                 #( = 1 "       (String $X#4136 Z S ()))" )
P;HTML|
;                                  #( = 1 "" )
P;HTML|
;                                  #( = 1 "     (MeTTa-Test \"Filter-Variable\" (Filter-Variable (some-value)) " )
P;HTML|
;                                  #( = 1 "       (GroundingSpace-top) " )
P;HTML|
;                                   #( = 1 "       (String $X#4930 ()))" )
P;HTML|
;                                   #( = 1 "" )
P;HTML|
;                                    #( = 1 "     (MeTTa-Test \"Filter-Grounded\" (Filter-Grounded (some-value)) " )
P;HTML|
;                                    #( = 1 "       (1 \"a\" 'c' Z (S Z)) " )
P;HTML|
;                                    #( = 1 "       (String \"a\" 'c' $X#5630 1 () \"x: 1 y: 2\"))" )
P;HTML|
;                                     #( = 1 "" )
P;HTML|
;                                     #( = 1 "     (MeTTa-Test \"Filter-Type\" (Filter-Type (some-value)) " )
P;HTML|
;                                      #( = 1 "       (String) " )
P;HTML|
;                                      #( = 1 "       (String $X#6487 ()))" )
P;HTML|
;                                      #( = 1 "" )
P;HTML|
;                                       #( = 1 "" )
P;HTML|
;                                       #( = 1 "     (MeTTa-Test \"Filter-%Undefined%\" (Filter-%Undefined% (some-value)) " )
P;HTML|
;                                        #( = 1 "       (all the values) " )
P;HTML|
;                                        #( = 1 "       (String \"a\" 'c' $X#7189 1 Z S () () 5 \"x: 1 y: 2\" (S (S Z)) (Cons 1 (Cons 2 (Cons 3 Nil))) (S Z)))" )
P;HTML|
;                                        #( = 1 "" )
P;HTML|
;                                         #( = 1 "" )
P;HTML|
;                                         #( = 1 "     (MeTTa-Test \"Filter-TVar\" (Filter-TVar (some-value)) " )
P;HTML|
;                                         #( = 1 "       (1 \"a\" Z (S Z) (S (S Z))) " )
P;HTML|
;                                         #( = 1 "       (String \"a\" 'c' $X#10203 1 Z S () () 5 \"x: 1 y: 2\" (S (S Z)) (Cons 1 (Cons 2 (Cons 3 Nil))) (S Z)))" )
P;HTML|
;                                         #( = 1 "" )
P;HTML|
;                                         #( = 1 "     (MeTTa-Test \"Filter-Undeclared\" (Filter-Undeclared (some-value)) " )
P;HTML|
;                                         #( = 1 "       () " )
P;HTML|
;                                         #( = 1 "       (String $X#13473 ()))" )
P;HTML|
;                                         #( = 1 "" )
P;HTML|
;                                         #( = 1 "" )
P;HTML|
;                                         #( = 1 "     (MeTTa-Test \"Filter-Expression\" (Filter-Expression (some-value)) " )
P;HTML|
;                                         #( = 1 "       ((+ 2 3) (format-args \"x: {} y: {}\" (1 2))) " )
P;HTML|
;                                         #( = 1 "       (String \"a\" 'c' $X#14170 1 Z S () () 5 \"x: 1 y: 2\" (S (S Z)) (Cons 1 (Cons 2 (Cons 3 Nil))) (S Z)))" )
P;HTML|
;                                         #( = 1 "" )
P;HTML|
;                                         #( = 1 "" )
P;HTML|
;                                         #( = 1 "     (MeTTa-Test \"Filter-Atom\" (Filter-Atom (some-value)) " )
P;HTML|
;                                         #( = 1 "       (1 \"a\" 'c' S Z (S Z)) " )
P;HTML|
;                                         #( = 1 "       (String \"a\" 'c' $X#16920 1 Z S () () 5 \"x: 1 y: 2\" (S (S Z)) (Cons 1 (Cons 2 (Cons 3 Nil))) (S Z)))" )
P;HTML|
;                                         #( = 1 "" )
P;HTML|
;                                         #( = 1 "" )
P;HTML|
;                                         #( = 1 "     (MeTTa-Test \"Filter-ExpressionNumber\" (Filter-ExpressionNumber (some-value)) " )
P;HTML|
;                                         #( = 1 "       ((+ 2 3)) " )
P;HTML|
;                                         #( = 1 "       (String \"a\" 'c' $X#19708 1 Z S () () 5 \"x: 1 y: 2\" (S (S Z)) (Cons 1 (Cons 2 (Cons 3 Nil))) (S Z)))" )
P;HTML|
;                                         #( = 1 "" )
P;HTML|
;                                         #( = 1 "" )
P;HTML|
;                                         #( = 1 "     (MeTTa-Test \"Filter-ExpressionUnit\" (Filter-ExpressionUnit (some-value)) " )
P;HTML|
;                                         #( = 1 "       (empty (println! \"did it\")) " )
P;HTML|
;                                         #( = 1 "       (String \"a\" 'c' $X#22392 1 Z S () () 5 \"x: 1 y: 2\" (S (S Z)) (Cons 1 (Cons 2 (Cons 3 Nil))) (S Z)))" )
P;HTML|
;                                         #( = 1 "" )
P;HTML|
;                                         #( = 1 "" )
P;HTML|
;                                         #( = 1 "     (MeTTa-Test \"Filter-ExpressionAtom\" (Filter-ExpressionAtom (some-value)) " )
P;HTML|
;                                         #( = 1 "       () " )
P;HTML|
;                                         #( = 1 "       (String \"a\" 'c' $X#25084 1 Z S () () 5 \"x: 1 y: 2\" (S (S Z)) (Cons 1 (Cons 2 (Cons 3 Nil))) (S Z)))" )
P;HTML|
;                                         #( = 1 "" )
P;HTML|
;                                         #( = 1 "" )
P;HTML|
;                                         #( = 1 "     (MeTTa-Test \"Filter-AtomAtom\" (Filter-AtomAtom (some-value)) " )
P;HTML|
;                                         #( = 1 "       (Z String \"a\" 1 'c' $X S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) \"x: 1 y: 2\" (S (S Z)) ()) " )
P;HTML|
;                                         #( = 1 "       (String \"a\" 'c' $X#27752 1 Z S () () 5 \"x: 1 y: 2\" (S (S Z)) (Cons 1 (Cons 2 (Cons 3 Nil))) (S Z)))" )
P;HTML|
;                                         #( = 1 "" )
P;HTML|
;                                         #( = 1 "     (MeTTa-Test \"Filter-Char\" (Filter-Char (some-value)) " )
P;HTML|
;                                         #( = 1 "       ('c') " )
P;HTML|
;                                         #( = 1 "       (String 'c' $X#31339 ()))" )
P;HTML|
;                                         #( = 1 "" )
P;HTML|
;                                         #( = 1 "     (MeTTa-Test \"Filter-Empty\" (Filter-Empty (some-value)) " )
P;HTML|
;                                         #( = 1 "       (empty (println! \"did it\") ()) " )
P;HTML|
;                                         #( = 1 "       (String $X#32063 ()))" )
P;HTML|
;                                         #( = 1 "" )
P;HTML|
;                                         #( = 1 "     (MeTTa-Test \"Filter-List\" (Filter-List (some-value)) " )
P;HTML|
;                                         #( = 1 "       ((Cons 1 (Cons 2 (Cons 3 Nil)))) " )
P;HTML|
;                                         #( = 1 "       (String $X#32805 () (Cons 1 (Cons 2 (Cons 3 Nil)))))" )
P;HTML|
;                                         #( = 1 "[()]" )
P;HTML|
;                                         #( = 2 "[()]" )
P;HTML|
;                                         #( = 3 "[()]" )
P;HTML|
;                                         #( = 4 "[()]" )
P;HTML|
;                                         #( = 5 "[()]" )
P;HTML|
;                                         #( = 6 "[()]" )
P;HTML|
;                                         #( = 7 "[()]" )
P;HTML|
;                                         #( = 8 "[()]" )
P;HTML|
;                                         #( = 9 "[()]" )
P;HTML|
;                                         #( = 10 "[()]" )
P;HTML|
;                                         #( = 11 "[()]" )
P;HTML|
;                                         #( = 12 "[()]" )
P;HTML|
;                                         #( = 13 "[()]" )
P;HTML|
;                                         #( = 14 "[()]" )
P;HTML|
;                                         #( = 15 "[()]" )
P;HTML|
;                                         #( = 16 "[()]" )
P;HTML|
;                                         #( = 17 "[()]" )
P;HTML|
;                                         #( = 18 "[()]" )
P;HTML|
;                                         #( = 19 "[()]" )
P;HTML|
;                                         #( = 20 "[()]" )
P;HTML|
;                                         #( = 21 "[()]" )
P;HTML|
;                                         #( = 22 "0.55user 0.01system 0:00.56elapsed 99%CPU (0avgtext+0avgdata 28648maxresident)k" )
P;HTML|
;                                         #( = 22 "0inputs+0outputs (0major+3559minor)pagefaults 0swaps" )
P;HTML|
;                        #(load_answer_file /home/runner/work/metta-testsuite/metta-testsuite/tests/baseline_compat/hyperon-mettalog_sanity/type_filtering_tests.metta.answers /home/runner/work/metta-testsuite/metta-testsuite/tests/baseline_compat/hyperon-mettalog_sanity/type_filtering_tests.metta)

;;;; Define Nat
<span class="ansi38-255165000"
> (: Nat Type)
</span><span class="ansi38-255165000"
> (: Z Nat)
</span><span class="ansi38-255165000"
> (: S (-> Nat Nat))
</span>;;;; Define List
<span class="ansi38-255165000"
> (: List (-> $a Type))
</span><span class="ansi38-255165000"
> (: Nil (List $a))
</span><span class="ansi38-255165000"
> (: Cons (-> $a (List $a) (List $a)))
</span>;;;; Define some-value returning various types
<span class="ansi38-255165000"
> (= (some-value)  1)
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('some-value', 1, 0, [], 'AnyRet', [], x(doeval, eager), ['some-value'], 1).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_0__some-value'</span>(<span class="pl-args"
><span class="pl-int"
>1</span></span>)</span>, 
  []].&#13;&#10;
'mc_0__some-value'(1).
<span class="ansi36"
>
'mc_0__some-value'(1).

</span>
;;; Number
<span class="ansi38-255165000"
> (= (some-value)  "a")
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('some-value', 1, 1, [], 'AnyRet', [], x(doeval, eager), ['some-value'], "a").

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_0__some-value'</span>(<span class="pl-args"
><span class="pl-var"
>A</span></span>)</span>, 
  [ [ assign,  A   , "a"  ]]].&#13;&#10;
'mc_0__some-value'(A) :-
    A="a".
<span class="ansi36"
>
'mc_0__some-value'(A) :-
    A="a".

</span>
;;; String
<span class="ansi38-255165000"
> (= (some-value)  'c')
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('some-value', 1, 2, [], 'AnyRet', [], x(doeval, eager), ['some-value'], #\c).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_0__some-value'</span>(<span class="pl-args"
><span class="pl-atom"
>c</span></span>)</span>, 
  []].&#13;&#10;
'mc_0__some-value'(c).
<span class="ansi36"
>
'mc_0__some-value'(c).

</span>
;;; Char
<span class="ansi38-255165000"
> (= (some-value)  $V)
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('some-value', 1, 3, [], 'AnyRet', [], x(doeval, eager), ['some-value'], _V).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_0__some-value'</span>(<span class="pl-args"
><span class="pl-var"
>_V</span></span>)</span>, 
  []].&#13;&#10;
'mc_0__some-value'(_V).
<span class="ansi36"
>
'mc_0__some-value'(_V).

</span>
;;; Variable
<span class="ansi38-255165000"
> (= (some-value)  
  (Cons 1 
    (Cons 2 
      (Cons 3 Nil))))
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('some-value', 1, 4, [], 'AnyRet', [], x(doeval, eager), ['some-value'], ['Cons', 1, ['Cons', 2, ['Cons', 3, 'Nil']]]).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_0__some-value'</span>(<span class="pl-args"
><span class="pl-var"
>A</span></span>)</span>, 
  [ <span class="pl-list"
><span class="pl-functor"
> [ </span><span class="pl-args"
><span class="pl-atom"
>assign</span>, <span class="pl-var"
>B</span>|<span class="pl-ellipsis"
>...</span></span>]</span>, 
    [ <span class="pl-atom"
>assign</span>, 
      <span class="pl-var"
>C</span>, 
      [ <span class="pl-compound pl-level-0"
><span class="pl-functor"
>call</span>(<span class="pl-args"
><span class="pl-atom"
>'Cons'</span></span>)</span>, <span class="pl-int"
>3</span>, <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'$VAR'</span>(<span class="pl-args"
><span class="pl-int"
>1</span></span>)</span>]], 
    [ <span class="pl-atom"
>assign</span>, 
      <span class="pl-var"
>D</span>, 
      [ <span class="pl-compound pl-level-0"
><span class="pl-functor"
>call</span>(<span class="pl-args"
><span class="pl-atom"
>'Cons'</span></span>)</span>, <span class="pl-int"
>2</span>, <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'$VAR'</span>(<span class="pl-args"
><span class="pl-int"
>2</span></span>)</span>]], 
    [ <span class="pl-atom"
>assign</span>, 
      <span class="pl-var"
>A</span>, 
      [ <span class="pl-compound pl-level-0"
><span class="pl-functor"
>call</span>(<span class="pl-args"
><span class="pl-atom"
>'Cons'</span></span>)</span>, <span class="pl-int"
>1</span>, <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'$VAR'</span>(<span class="pl-args"
><span class="pl-int"
>3</span></span>)</span>]]]].&#13;&#10;
Asserting: transpiler_depends_on('some-value',1,'Cons',3)
<span class="ansi36"
>transpiler_stub_created('Cons'/3).

</span>; % ######### warning: creating stub for:'Cons'
<span class="ansi36"
>
mc_2__Cons(B, C, D) :-
    D=['Cons', B, C].

</span>'mc_0__some-value'(A) :-
    B='Nil',
    mc_2__Cons(3, B, C),
    mc_2__Cons(2, C, D),
    mc_2__Cons(1, D, A).
<span class="ansi36"
>
'mc_0__some-value'(A) :-
    B='Nil',
    mc_2__Cons(3, B, C),
    mc_2__Cons(2, C, D),
    mc_2__Cons(1, D, A).

</span>
;;; Example List
<span class="ansi38-255165000"
> (= (some-value)  
  (+ 2 3))
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('some-value', 1, 5, [], 'AnyRet', [], x(doeval, eager), ['some-value'], [+, 2, 3]).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_0__some-value'</span>(<span class="pl-args"
><span class="pl-var"
>A</span></span>)</span>, 
  [ [ <span class="pl-atom"
>assign</span>, 
      <span class="pl-var"
>A</span>, 
      [ <span class="pl-compound pl-level-0"
><span class="pl-functor"
>call</span>(<span class="pl-args"
><span class="pl-atom"
>+</span></span>)</span>, <span class="pl-int"
>2</span>, <span class="pl-int"
>3</span>]]]].&#13;&#10;
Asserting: transpiler_depends_on('some-value',1,+,3)
'mc_0__some-value'(A) :-
    'mc_2__+'(2, 3, A).
<span class="ansi36"
>
'mc_0__some-value'(A) :-
    'mc_2__+'(2, 3, A).

</span>
;;; Returns number  
<span class="ansi38-255165000"
> (= (some-value)  
  (println! ""))
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('some-value', 1, 6, [], 'AnyRet', [], x(doeval, eager), ['some-value'], ['println!', ""]).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_0__some-value'</span>(<span class="pl-args"
><span class="pl-var"
>A</span></span>)</span>, 
  [ [ <span class="pl-atom"
>assign</span>, <span class="pl-var"
>B</span>, <span class="pl-string"
>""</span>], 
    [ <span class="pl-atom"
>assign</span>, 
      <span class="pl-var"
>A</span>, 
      [ <span class="pl-compound pl-level-0"
><span class="pl-functor"
>call</span>(<span class="pl-args"
><span class="pl-atom"
>'println!'</span></span>)</span>, 
        <span class="pl-var"
>B</span>]]]].&#13;&#10;
Asserting: transpiler_depends_on('some-value',1,'println!',2)
'mc_0__some-value'(A) :-
    B="",
    'mc_1__println!'(B, A).
<span class="ansi36"
>
'mc_0__some-value'(A) :-
    B="",
    'mc_1__println!'(B, A).

</span>
;;; Returns empty
<span class="ansi38-255165000"
> (= (some-value)  
  (empty))
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('some-value', 1, 7, [], 'AnyRet', [], x(doeval, eager), ['some-value'], [empty]).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_0__some-value'</span>(<span class="pl-args"
><span class="pl-var"
>A</span></span>)</span>, 
  [ [ <span class="pl-atom"
>assign</span>, 
      <span class="pl-var"
>A</span>, 
      <span class="pl-list"
><span class="pl-functor"
> [ </span><span class="pl-args"
><span class="pl-compound"
><span class="pl-functor"
>call</span>(<span class="pl-args"
><span class="pl-atom"
>empty</span></span>)</span></span>]</span>]]].&#13;&#10;
Asserting: transpiler_depends_on('some-value',1,empty,1)
'mc_0__some-value'(A) :-
    mc_0__empty(A).
<span class="ansi36"
>
'mc_0__some-value'(A) :-
    mc_0__empty(A).

</span>
;;; Returns empty
<span class="ansi38-255165000"
> (= (some-value)  )
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('some-value', 1, 8, [], 'AnyRet', [], x(doeval, eager), ['some-value'], []).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_0__some-value'</span>(<span class="pl-args"
><span class="pl-var"
>A</span></span>)</span>, 
  <span class="pl-list"
><span class="pl-functor"
> [ </span><span class="pl-args"
><span class="pl-list"
><span class="pl-functor"
> [ </span><span class="pl-args"
><span class="pl-atom"
>assign</span>|<span class="pl-ellipsis"
>...</span></span>]</span></span>]</span>].&#13;&#10;
'mc_0__some-value'(A) :-
    A=[].
<span class="ansi36"
>
'mc_0__some-value'(A) :-
    A=[].

</span>
;;; Empty Expression (not empty like teh tow above)
<span class="ansi38-255165000"
> (= (some-value)  
  (format-args "x: {} y: {}" 
    (1 2)))
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('some-value', 1, 9, [], 'AnyRet', [], x(doeval, eager), ['some-value'], ['format-args', "x: {} y: {}", [1, 2]]).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_0__some-value'</span>(<span class="pl-args"
><span class="pl-var"
>A</span></span>)</span>, 
  [ [ <span class="pl-atom"
>assign</span>, <span class="pl-var"
>B</span>, <span class="pl-string"
>"x: {} y: {}"</span>], 
    [ <span class="pl-atom"
>assign</span>, <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'$VAR'</span>(<span class="pl-args"
><span class="pl-int"
>2</span></span>)</span>, <span class="pl-compound pl-level-0"
><span class="pl-functor"
>list</span>(<span class="pl-args"
><span class="pl-list"
><span class="pl-functor"
> [ </span><span class="pl-args"
><span class="pl-int"
>1</span>|<span class="pl-ellipsis"
>...</span></span>]</span></span>)</span>], 
    [ <span class="pl-atom"
>assign</span>, 
      <span class="pl-var"
>A</span>, 
      [ <span class="pl-compound pl-level-0"
><span class="pl-functor"
>call</span>(<span class="pl-args"
><span class="pl-atom"
>'format-args'</span></span>)</span>, <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'$VAR'</span>(<span class="pl-args"
><span class="pl-int"
>1</span></span>)</span>, <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'$VAR'</span>(<span class="pl-args"
><span class="pl-int"
>2</span></span>)</span>]]]].&#13;&#10;
Asserting: transpiler_depends_on('some-value',1,'format-args',3)
<span class="ansi36"
>transpiler_stub_created('format-args'/3).

</span>; % ######### warning: creating stub for:'format-args'
<span class="ansi36"
>
'mc_2__format-args'(B, C, D) :-
    D=['format-args', B, C].

</span>'mc_0__some-value'(A) :-
    B="x: {} y: {}",
    C=[1, 2],
    'mc_2__format-args'(B, C, A).
<span class="ansi36"
>
'mc_0__some-value'(A) :-
    B="x: {} y: {}",
    C=[1, 2],
    'mc_2__format-args'(B, C, A).

</span>
;;; Formatted string
<span class="ansi38-255165000"
> (= (some-value)  S)
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('some-value', 1, 10, [], 'AnyRet', [], x(doeval, eager), ['some-value'], 'S').

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_0__some-value'</span>(<span class="pl-args"
><span class="pl-var"
>A</span></span>)</span>, 
  [ [ assign,  A   , 'S'  ]]].&#13;&#10;
'mc_0__some-value'(A) :-
    A='S'.
<span class="ansi36"
>
'mc_0__some-value'(A) :-
    A='S'.

</span>
;;; Symbol (not a Nat)
<span class="ansi38-255165000"
> (= (some-value)  Z)
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('some-value', 1, 11, [], 'AnyRet', [], x(doeval, eager), ['some-value'], 'Z').

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_0__some-value'</span>(<span class="pl-args"
><span class="pl-var"
>A</span></span>)</span>, 
  [ [ assign,  A   , 'Z'  ]]].&#13;&#10;
'mc_0__some-value'(A) :-
    A='Z'.
<span class="ansi36"
>
'mc_0__some-value'(A) :-
    A='Z'.

</span>
;;; Nat
<span class="ansi38-255165000"
> (= (some-value)  
  (S Z))
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('some-value', 1, 12, [], 'AnyRet', [], x(doeval, eager), ['some-value'], ['S', 'Z']).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_0__some-value'</span>(<span class="pl-args"
><span class="pl-var"
>A</span></span>)</span>, 
  [ <span class="pl-list"
><span class="pl-functor"
> [ </span><span class="pl-args"
><span class="pl-atom"
>assign</span>, <span class="pl-var"
>B</span>|<span class="pl-ellipsis"
>...</span></span>]</span>, 
    [ <span class="pl-atom"
>assign</span>, 
      <span class="pl-var"
>A</span>, 
      [ <span class="pl-compound pl-level-0"
><span class="pl-functor"
>call</span>(<span class="pl-args"
><span class="pl-atom"
>'S'</span></span>)</span>, 
        <span class="pl-var"
>B</span>]]]].&#13;&#10;
Asserting: transpiler_depends_on('some-value',1,'S',2)
<span class="ansi36"
>transpiler_stub_created('S'/2).

</span>; % ######### warning: creating stub for:'S'
<span class="ansi36"
>
mc_1__S(B, C) :-
    C=['S', B].

</span>'mc_0__some-value'(A) :-
    B='Z',
    mc_1__S(B, A).
<span class="ansi36"
>
'mc_0__some-value'(A) :-
    B='Z',
    mc_1__S(B, A).

</span>
;;; Nat
<span class="ansi38-255165000"
> (= (some-value)  String)
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('some-value', 1, 13, [], 'AnyRet', [], x(doeval, eager), ['some-value'], 'String').

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_0__some-value'</span>(<span class="pl-args"
><span class="pl-var"
>A</span></span>)</span>, 
  [ [  assign ,   A    ,'String']]].&#13;&#10;
'mc_0__some-value'(A) :-
    A='String'.
<span class="ansi36"
>
'mc_0__some-value'(A) :-
    A='String'.

</span>
;;; Type
<span class="ansi38-255165000"
> (= (some-value)  
  (S (S Z)))
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('some-value', 1, 14, [], 'AnyRet', [], x(doeval, eager), ['some-value'], ['S', ['S', 'Z']]).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_0__some-value'</span>(<span class="pl-args"
><span class="pl-var"
>A</span></span>)</span>, 
  [ <span class="pl-list"
><span class="pl-functor"
> [ </span><span class="pl-args"
><span class="pl-atom"
>assign</span>, <span class="pl-var"
>B</span>|<span class="pl-ellipsis"
>...</span></span>]</span>, 
    [ <span class="pl-atom"
>assign</span>, 
      <span class="pl-var"
>C</span>, 
      [ <span class="pl-compound pl-level-0"
><span class="pl-functor"
>call</span>(<span class="pl-args"
><span class="pl-atom"
>'S'</span></span>)</span>, 
        <span class="pl-var"
>B</span>]], 
    [ <span class="pl-atom"
>assign</span>, 
      <span class="pl-var"
>A</span>, 
      [ <span class="pl-compound pl-level-0"
><span class="pl-functor"
>call</span>(<span class="pl-args"
><span class="pl-atom"
>'S'</span></span>)</span>, 
        <span class="pl-var"
>C</span>]]]].&#13;&#10;
'mc_0__some-value'(A) :-
    B='Z',
    mc_1__S(B, C),
    mc_1__S(C, A).
<span class="ansi36"
>
'mc_0__some-value'(A) :-
    B='Z',
    mc_1__S(B, C),
    mc_1__S(C, A).

</span>
;;; Nat
;;; (= (some-value) &self)                 ; Grounded Space
;;;; Filter definitions
<span class="ansi38-255165000"
> (: Filter-String (-> String $t))
</span><span class="ansi38-255165000"
> (: Filter-Number (-> Number $t))
</span><span class="ansi38-255165000"
> (: Filter-Nat (-> Nat $t))
</span><span class="ansi38-255165000"
> (: Filter-Symbol (-> Symbol $t))
</span><span class="ansi38-255165000"
> (: Filter-Variable (-> Variable $t))
</span><span class="ansi38-255165000"
> (: Filter-Grounded (-> Grounded $t))
</span><span class="ansi38-255165000"
> (: Filter-Type (-> Type $t))
</span><span class="ansi38-255165000"
> (: Filter-%Undefined% (-> %Undefined% $t))
</span><span class="ansi38-255165000"
> (: Filter-TVar (-> $t $t))
</span><span class="ansi38-255165000"
> (: Filter-Undeclared (-> Undeclared $t))
</span>;;; undeclared type
<span class="ansi38-255165000"
> (: Filter-Expression (-> Expression $t))
</span><span class="ansi38-255165000"
> (: Filter-Atom (-> Atom $t))
</span><span class="ansi38-255165000"
> (: Filter-ExpressionNumber (-> Expression Number))
</span><span class="ansi38-255165000"
> (: Filter-ExpressionUnit (-> Expression (->)))
</span><span class="ansi38-255165000"
> (: Filter-ExpressionAtom (-> Expression Atom))
</span><span class="ansi38-255165000"
> (: Filter-AtomAtom (-> Atom Atom))
</span><span class="ansi38-255165000"
> (: Filter-Char (-> Char $t))
</span><span class="ansi38-255165000"
> (: Filter-Empty (->  $t))
</span><span class="ansi38-255165000"
> (: Filter-List (-> (List $a) $t))
</span><span class="ansi38-255165000"
> (= (Filter-String $a)  $a)
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('Filter-String', 2, 0, ['String'], 'Number', [x(doeval, eager)], x(doeval, eager), ['Filter-String', _a], _a).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_1__Filter-String'</span>(<span class="pl-args"
><span class="pl-var"
>_a</span>, <span class="pl-var"
>_a</span></span>)</span>, 
  []].&#13;&#10;
'mc_1__Filter-String'(_a, _a).
<span class="ansi36"
>
'mc_1__Filter-String'(_a, _a).

</span>
<span class="ansi38-255165000"
> (= (Filter-Number $a)  $a)
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('Filter-Number', 2, 0, ['Number'], 'Number', [x(doeval, eager)], x(doeval, eager), ['Filter-Number', _a], _a).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_1__Filter-Number'</span>(<span class="pl-args"
><span class="pl-var"
>_a</span>, <span class="pl-var"
>_a</span></span>)</span>, 
  []].&#13;&#10;
'mc_1__Filter-Number'(_a, _a).
<span class="ansi36"
>
'mc_1__Filter-Number'(_a, _a).

</span>
<span class="ansi38-255165000"
> (= (Filter-Nat $a)  $a)
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('Filter-Nat', 2, 0, ['Nat'], 'Number', [x(doeval, eager)], x(doeval, eager), ['Filter-Nat', _a], _a).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_1__Filter-Nat'</span>(<span class="pl-args"
><span class="pl-var"
>_a</span>, <span class="pl-var"
>_a</span></span>)</span>, 
  []].&#13;&#10;
'mc_1__Filter-Nat'(_a, _a).
<span class="ansi36"
>
'mc_1__Filter-Nat'(_a, _a).

</span>
<span class="ansi38-255165000"
> (= (Filter-Symbol $a)  $a)
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('Filter-Symbol', 2, 0, ['Symbol'], 'Number', [x(doeval, eager)], x(doeval, eager), ['Filter-Symbol', _a], _a).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_1__Filter-Symbol'</span>(<span class="pl-args"
><span class="pl-var"
>_a</span>, <span class="pl-var"
>_a</span></span>)</span>, 
  []].&#13;&#10;
'mc_1__Filter-Symbol'(_a, _a).
<span class="ansi36"
>
'mc_1__Filter-Symbol'(_a, _a).

</span>
<span class="ansi38-255165000"
> (= (Filter-Variable $a)  $a)
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('Filter-Variable', 2, 0, ['Variable'], 'Number', [x(doeval, eager)], x(doeval, eager), ['Filter-Variable', _a], _a).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_1__Filter-Variable'</span>(<span class="pl-args"
><span class="pl-var"
>_a</span>, <span class="pl-var"
>_a</span></span>)</span>, 
  []].&#13;&#10;
'mc_1__Filter-Variable'(_a, _a).
<span class="ansi36"
>
'mc_1__Filter-Variable'(_a, _a).

</span>
<span class="ansi38-255165000"
> (= (Filter-Grounded $a)  $a)
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('Filter-Grounded', 2, 0, ['Grounded'], 'Number', [x(doeval, eager)], x(doeval, eager), ['Filter-Grounded', _a], _a).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_1__Filter-Grounded'</span>(<span class="pl-args"
><span class="pl-var"
>_a</span>, <span class="pl-var"
>_a</span></span>)</span>, 
  []].&#13;&#10;
'mc_1__Filter-Grounded'(_a, _a).
<span class="ansi36"
>
'mc_1__Filter-Grounded'(_a, _a).

</span>
<span class="ansi38-255165000"
> (= (Filter-Type $a)  $a)
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('Filter-Type', 2, 0, ['Type'], 'Number', [x(doeval, eager)], x(doeval, eager), ['Filter-Type', _a], _a).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_1__Filter-Type'</span>(<span class="pl-args"
><span class="pl-var"
>_a</span>, <span class="pl-var"
>_a</span></span>)</span>, 
  []].&#13;&#10;
'mc_1__Filter-Type'(_a, _a).
<span class="ansi36"
>
'mc_1__Filter-Type'(_a, _a).

</span>
<span class="ansi38-255165000"
> (= (Filter-%Undefined% $a)  $a)
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('Filter-%Undefined%', 2, 0, ['%Undefined%'], 'Number', [x(doeval, eager)], x(doeval, eager), ['Filter-%Undefined%', _a], _a).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_1__Filter-%Undefined%'</span>(<span class="pl-args"
><span class="pl-var"
>_a</span>, <span class="pl-var"
>_a</span></span>)</span>, 
  []].&#13;&#10;
'mc_1__Filter-%Undefined%'(_a, _a).
<span class="ansi36"
>
'mc_1__Filter-%Undefined%'(_a, _a).

</span>
<span class="ansi38-255165000"
> (= (Filter-TVar $a)  $a)
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('Filter-TVar', 2, 0, ['Number'], 'Number', [x(doeval, eager)], x(doeval, eager), ['Filter-TVar', _a], _a).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_1__Filter-TVar'</span>(<span class="pl-args"
><span class="pl-var"
>_a</span>, <span class="pl-var"
>_a</span></span>)</span>, 
  []].&#13;&#10;
'mc_1__Filter-TVar'(_a, _a).
<span class="ansi36"
>
'mc_1__Filter-TVar'(_a, _a).

</span>
<span class="ansi38-255165000"
> (= (Filter-Undeclared $a)  $a)
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('Filter-Undeclared', 2, 0, ['Undeclared'], 'Number', [x(doeval, eager)], x(doeval, eager), ['Filter-Undeclared', _a], _a).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_1__Filter-Undeclared'</span>(<span class="pl-args"
><span class="pl-var"
>_a</span>, <span class="pl-var"
>_a</span></span>)</span>, 
  []].&#13;&#10;
'mc_1__Filter-Undeclared'(_a, _a).
<span class="ansi36"
>
'mc_1__Filter-Undeclared'(_a, _a).

</span>
<span class="ansi38-255165000"
> (= (Filter-Expression $a)  $a)
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('Filter-Expression', 2, 0, ['Expression'], 'Number', [x(doeval, lazy)], x(doeval, eager), ['Filter-Expression', _a], _a).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_1__Filter-Expression'</span>(<span class="pl-args"
><span class="pl-var"
>_a</span>, <span class="pl-var"
>A</span></span>)</span>, 
  [ [ <span class="pl-compound pl-level-0"
><span class="pl-functor"
>native</span>(<span class="pl-args"
><span class="pl-atom"
>as_p1</span></span>)</span>, <span class="pl-var"
>_a</span>, <span class="pl-var"
>A</span>]]].&#13;&#10;
'mc_1__Filter-Expression'(_a, A) :-
    as_p1(_a, A).
<span class="ansi36"
>
'mc_1__Filter-Expression'(_a, A) :-
    as_p1(_a, A).

</span>
<span class="ansi38-255165000"
> (= (Filter-Atom $a)  $a)
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('Filter-Atom', 2, 0, ['Atom'], 'Number', [x(doeval, lazy)], x(doeval, eager), ['Filter-Atom', _a], _a).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_1__Filter-Atom'</span>(<span class="pl-args"
><span class="pl-var"
>_a</span>, <span class="pl-var"
>A</span></span>)</span>, 
  [ [ <span class="pl-compound pl-level-0"
><span class="pl-functor"
>native</span>(<span class="pl-args"
><span class="pl-atom"
>as_p1</span></span>)</span>, <span class="pl-var"
>_a</span>, <span class="pl-var"
>A</span>]]].&#13;&#10;
'mc_1__Filter-Atom'(_a, A) :-
    as_p1(_a, A).
<span class="ansi36"
>
'mc_1__Filter-Atom'(_a, A) :-
    as_p1(_a, A).

</span>
<span class="ansi38-255165000"
> (= (Filter-ExpressionNumber $a)  $a)
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('Filter-ExpressionNumber', 2, 0, ['Expression'], 'Number', [x(doeval, lazy)], x(doeval, eager), ['Filter-ExpressionNumber', _a], _a).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_1__Filter-ExpressionNumber'</span>(<span class="pl-args"
><span class="pl-var"
>_a</span>, <span class="pl-var"
>A</span></span>)</span>, 
  [ [ <span class="pl-compound pl-level-0"
><span class="pl-functor"
>native</span>(<span class="pl-args"
><span class="pl-atom"
>as_p1</span></span>)</span>, <span class="pl-var"
>_a</span>, <span class="pl-var"
>A</span>]]].&#13;&#10;
'mc_1__Filter-ExpressionNumber'(_a, A) :-
    as_p1(_a, A).
<span class="ansi36"
>
'mc_1__Filter-ExpressionNumber'(_a, A) :-
    as_p1(_a, A).

</span>
<span class="ansi38-255165000"
> (= (Filter-ExpressionUnit $a)  $a)
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('Filter-ExpressionUnit', 2, 0, ['Expression'], [->], [x(doeval, lazy)], x(doeval, eager), ['Filter-ExpressionUnit', _a], _a).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_1__Filter-ExpressionUnit'</span>(<span class="pl-args"
><span class="pl-var"
>_a</span>, <span class="pl-var"
>A</span></span>)</span>, 
  [ [ <span class="pl-compound pl-level-0"
><span class="pl-functor"
>native</span>(<span class="pl-args"
><span class="pl-atom"
>as_p1</span></span>)</span>, <span class="pl-var"
>_a</span>, <span class="pl-var"
>A</span>]]].&#13;&#10;
'mc_1__Filter-ExpressionUnit'(_a, A) :-
    as_p1(_a, A).
<span class="ansi36"
>
'mc_1__Filter-ExpressionUnit'(_a, A) :-
    as_p1(_a, A).

</span>
<span class="ansi38-255165000"
> (= (Filter-ExpressionAtom $a)  $a)
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('Filter-ExpressionAtom', 2, 0, ['Expression'], 'Atom', [x(doeval, lazy)], x(doeval, lazy), ['Filter-ExpressionAtom', _a], _a).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_1__Filter-ExpressionAtom'</span>(<span class="pl-args"
><span class="pl-var"
>_a</span>, <span class="pl-var"
>_a</span></span>)</span>, 
  []].&#13;&#10;
'mc_1__Filter-ExpressionAtom'(_a, _a).
<span class="ansi36"
>
'mc_1__Filter-ExpressionAtom'(_a, _a).

</span>
<span class="ansi38-255165000"
> (= (Filter-AtomAtom $a)  $a)
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('Filter-AtomAtom', 2, 0, ['Atom'], 'Atom', [x(doeval, lazy)], x(doeval, lazy), ['Filter-AtomAtom', _a], _a).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_1__Filter-AtomAtom'</span>(<span class="pl-args"
><span class="pl-var"
>_a</span>, <span class="pl-var"
>_a</span></span>)</span>, 
  []].&#13;&#10;
'mc_1__Filter-AtomAtom'(_a, _a).
<span class="ansi36"
>
'mc_1__Filter-AtomAtom'(_a, _a).

</span>
<span class="ansi38-255165000"
> (= (Filter-Char $a)  $a)
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('Filter-Char', 2, 0, ['Char'], 'Number', [x(doeval, eager)], x(doeval, eager), ['Filter-Char', _a], _a).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_1__Filter-Char'</span>(<span class="pl-args"
><span class="pl-var"
>_a</span>, <span class="pl-var"
>_a</span></span>)</span>, 
  []].&#13;&#10;
'mc_1__Filter-Char'(_a, _a).
<span class="ansi36"
>
'mc_1__Filter-Char'(_a, _a).

</span>
<span class="ansi38-255165000"
> (= (Filter-Empty $a)  $a)
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('Filter-Empty', 2, 0, ['Empty'], 'Number', [x(doeval, eager)], x(doeval, eager), ['Filter-Empty', _a], _a).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_1__Filter-Empty'</span>(<span class="pl-args"
><span class="pl-var"
>_a</span>, <span class="pl-var"
>_a</span></span>)</span>, 
  []].&#13;&#10;
'mc_1__Filter-Empty'(_a, _a).
<span class="ansi36"
>
'mc_1__Filter-Empty'(_a, _a).

</span>
<span class="ansi38-255165000"
> (= (Filter-List $a)  $a)
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('Filter-List', 2, 0, [['List', A]], 'Number', [x(doeval, eager)], x(doeval, eager), ['Filter-List', _a], _a).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_1__Filter-List'</span>(<span class="pl-args"
><span class="pl-var"
>_a</span>, <span class="pl-var"
>_a</span></span>)</span>, 
  []].&#13;&#10;
'mc_1__Filter-List'(_a, _a).
<span class="ansi36"
>
'mc_1__Filter-List'(_a, _a).

</span>
<span class="ansi38-255165000"
> (: MeTTa-Test (-> String Atom Atom Atom Atom))
</span><span class="ansi38-255165000"
> (= (MeTTa-Test $Name $Form $List $passes)  
  (let 
    ($n $res $qform) 
    ($Name 
      (collapse $Form) 
      (quote $Form)) 
    (case $res 
      ( ($List (println! (format-args "\n     (MeTTa-Test \"{}\" {} \n        {} \n        {})" ($Name $Form $List $passes)))) ($_198560 (println! (format-args "\n     (MeTTa-Test \"{}\" {} \n       {} \n       {})" ($Name $Form $List $res))))))))
</span><span class="ansi38-255165005"
></span><span class="ansi36"
>transpiler_clause_store('MeTTa-Test', 5, 0, ['String', 'Atom', 'Atom', 'Atom'], 'Atom', [x(doeval, eager), x(doeval, lazy), x(doeval, eager), x(doeval, lazy)], x(doeval, lazy), ['MeTTa-Test', _Name, _Form, _List, _passes], [let, [_n, _res, _qform], [_Name, [collapse, _Form], [quote, _Form]], [case, _res, [[_List, ['println!', ['format-args', "\n     (MeTTa-Test \"{}\" {} \n        {} \n        {})", [_Name, _Form, _List, _passes]]]], [A, ['println!', ['format-args', "\n     (MeTTa-Test \"{}\" {} \n       {} \n       {})", [_Name, _Form, _List, _res]]]]]]]).

</span><span class="pl-functor"
>[ </span>
  <span class="pl-atom"
>=</span>, 
  <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'mc_4__MeTTa-Test'</span>(<span class="pl-args"
><span class="pl-var"
>_Name</span>, <span class="pl-var"
>_Form</span>, <span class="pl-var"
>_List</span>, <span class="pl-var"
>_passes</span>, <span class="pl-var"
>A</span></span>)</span>, 
  [ [ <span class="pl-atom"
>assign</span>, 
      <span class="pl-var"
>B</span>, 
      [ <span class="pl-compound pl-level-0"
><span class="pl-functor"
>call</span>(<span class="pl-args"
><span class="pl-atom"
>collapse</span></span>)</span>, 
        [ <span class="pl-atom"
>is_p1</span>, 
          [ [ <span class="pl-compound pl-level-0"
><span class="pl-functor"
>native</span>(<span class="pl-args"
><span class="pl-atom"
>as_p1</span></span>)</span>, <span class="pl-var"
>_Form</span>, <span class="pl-var"
>C</span>]], 
          <span class="pl-var"
>C</span>]]], 
    [ <span class="pl-atom"
>assign</span>, 
      <span class="pl-var"
>D</span>, 
      <span class="pl-list"
><span class="pl-functor"
> [ </span><span class="pl-args"
><span class="pl-atom"
>quote</span>, <span class="pl-var"
>_Form</span></span>]</span>], 
    [ <span class="pl-atom"
>assign</span>, 
      <span class="pl-var"
>E</span>, 
      <span class="pl-compound pl-level-0"
><span class="pl-functor"
>list</span>(<span class="pl-args"
><span class="pl-list"
><span class="pl-functor"
> [ </span><span class="pl-args"
><span class="pl-var"
>_Name</span>|<span class="pl-ellipsis"
>...</span></span>]</span></span>)</span>], 
    [ <span class="pl-atom"
>assign</span>, 
      <span class="pl-list"
><span class="pl-functor"
> [ </span><span class="pl-args"
><span class="pl-var"
>_n</span>, <span class="pl-var"
>_res</span>|<span class="pl-ellipsis"
>...</span></span>]</span>, 
      <span class="pl-var"
>E</span>], 
    [ <span class="pl-atom"
>prolog_if</span>, 
      [ [ prolog_match,    _res    ,   _List    ]], 
      [ [ <span class="pl-atom"
>assign</span>,  <span class="pl-var"
>F</span>, <span class="pl-string"
>"\n     (MeTTa-Test \"{}\" {} \n        {} \n        {})"</span>], 
        [ <span class="pl-compound pl-level-0"
><span class="pl-functor"
>native</span>(<span class="pl-args"
><span class="pl-atom"
>as_p1</span></span>)</span>, <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'$VAR'</span>(<span class="pl-args"
><span class="pl-atom"
>'_Form'</span></span>)</span>, <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'$VAR'</span>(<span class="pl-args"
><span class="pl-int"
>6</span></span>)</span>], 
        [ <span class="pl-compound pl-level-0"
><span class="pl-functor"
>native</span>(<span class="pl-args"
><span class="pl-atom"
>as_p1</span></span>)</span>, <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'$VAR'</span>(<span class="pl-args"
><span class="pl-atom"
>'_passes'</span></span>)</span>, <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'$VAR'</span>(<span class="pl-args"
><span class="pl-int"
>7</span></span>)</span>], 
        [ <span class="pl-atom"
>assign</span>, 
          <span class="pl-var"
>I</span>, 
          <span class="pl-compound pl-level-0"
><span class="pl-functor"
>list</span>(<span class="pl-args"
><span class="pl-list"
><span class="pl-functor"
> [ </span><span class="pl-args"
><span class="pl-var"
>_Name</span>|<span class="pl-ellipsis"
>...</span></span>]</span></span>)</span>], 
        [ <span class="pl-atom"
>assign</span>, 
          <span class="pl-var"
>J</span>, 
          [ <span class="pl-compound pl-level-0"
><span class="pl-functor"
>call</span>(<span class="pl-args"
><span class="pl-atom"
>'format-args'</span></span>)</span>, <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'$VAR'</span>(<span class="pl-args"
><span class="pl-int"
>5</span></span>)</span>, <span class="pl-compound pl-level-0"
><span class="pl-functor"
>'$VAR'</span>(<span class="pl-args"
><span class="pl-int"
>8</span></span>)</span>]], 
        [ <span class="pl-atom"
>assign</span>, 
          <span class="pl-var"
>K</span>, 
          [ <span class="pl-compound pl-level-0"
><span class="pl-functor"
>call</span>(<span class="pl-args"
><span class="pl-atom"
>'println!'</span></span>)</span>, 
            <span class="pl-var"
>J</span>]], 
        [ <span class="pl-atom"
>assign</span>, 
          <span class="pl-var"
>L</span>, 
          <span class="pl-list"
><span class="pl-functor"
> [ </span><span class="pl-args"
><span class="pl-atom"
>is_p1</span>, []|<span class="pl-ellipsis"
>...</span></span>]</span>], 
        <span class="pl-list"
><span class="pl-functor"
> [ </span><span class="pl-args"
><span class="pl-atom"
>assign</span>, <span class="pl-var"
>A</span>|<span class="pl-ellipsis"
>...</span></span>]</span>], 
      [ [ <span class="pl-atom"
>prolog_if</span>, 
          [ [ prolog_match,    _res    ,     _      ]], 
          [ [ <span class="pl-atom"
>assign</span>,  <span class="pl-var"
>M</span>, <span class="pl-string"
>"\n     (MeTTa-Test \"{}\" {} \n       {} \n       {})"</span>], 
            [ <span class="pl-compound pl-level-0"
><span class="pl-functor"
>native</span>(<span class="pl-args"
><span class="pl-atom"
>as_p1</span></span>)</span>, <span class="pl-var"
>_Form</span>, <span class="pl-var"
>N</span>], 
            [ <span class="pl-atom"
>assign</span>, 
              <span class="pl-var"
>O</span>, 
              <span class="pl-compound pl-level-0"
><span class="pl-functor"
>list</span>(<span class="pl-args"
><span class="pl-list"
><span class="pl-functor"
> [ </span><span class="pl-args"
><span class="pl-var"
>_Name</span>|<span class="pl-ellipsis"
>...</span></span>]</span></span>)</span>], 
            [ <span class="pl-atom"
>assign</span>, 
              <span class="pl-var"
>P</span>, 
              [ <span class="pl-compound pl-level-0"
><span class="pl-functor"
>call</span>(<span class="pl-args"
><span class="pl-atom"
>'format-args'</span></span>)</span>, <span class="pl-var"
>M</span>, <span class="pl-var"
>O</span>]], 
            [ <span class="pl-atom"
>assign</span>, 
              <span class="pl-var"
>Q</span>, 
              [ <span class="pl-compound pl-level-0"
><span class="pl-functor"
>call</span>(<span class="pl-args"
><span class="pl-atom"
>'println!'</span></span>)</span>, 
                <span class="pl-var"
>P</span>]], 
            [ <span class="pl-atom"
>assign</span>, 
              <span class="pl-var"
>R</span>, 
              <span class="pl-list"
><span class="pl-functor"
> [ </span><span class="pl-args"
><span class="pl-atom"
>is_p1</span>, []|<span class="pl-ellipsis"
>...</span></span>]</span>], 
            <span class="pl-list"
><span class="pl-functor"
> [ </span><span class="pl-args"
><span class="pl-atom"
>assign</span>, <span class="pl-var"
>S</span>|<span class="pl-ellipsis"
>...</span></span>]</span>], 
          [ [ assign ,   T   ,'Empty'],
            [ assign ,   S   ,   T   ]]], 
        <span class="pl-list"
><span class="pl-functor"
> [ </span><span class="pl-args"
><span class="pl-atom"
>assign</span>, <span class="pl-var"
>A</span>|<span class="pl-ellipsis"
>...</span></span>]</span>]]]].&#13;&#10;
Asserting: transpiler_depends_on('MeTTa-Test',5,collapse,2)
Asserting: transpiler_depends_on('MeTTa-Test',5,'format-args',3)
Asserting: transpiler_depends_on('MeTTa-Test',5,'println!',2)
'mc_4__MeTTa-Test'(_Name, _Form, _List, _passes, A) :-
    mc_1__collapse(is_p1(as_p1(_Form, B), B), C),
    D=[quote, _Form],
    E=[_Name, C, D],
    [_n, _res, _qform]=E,
    (   _res=_List
    *-> F="\n     (MeTTa-Test \"{}\" {} \n        {} \n        {})",
        as_p1(_Form, G),
        as_p1(_passes, H),
        I=[_Name, G, _List, H],
        'mc_2__format-args'(F, I, J),
        'mc_1__println!'(J, K),
        L=is_p1(true, K),
        A=L
    ;   (   _res=_
        *-> M="\n     (MeTTa-Test \"{}\" {} \n       {} \n       {})",
            as_p1(_Form, N),
            O=[_Name, N, _List, _res],
            'mc_2__format-args'(M, O, P),
            'mc_1__println!'(P, Q),
            R=is_p1(true, Q),
            S=R
        ;   T='Empty',
            S=T
        ),
        A=S
    ).
<span class="ansi36"
>
'mc_4__MeTTa-Test'(_Name, _Form, _List, _passes, A) :-
    mc_1__collapse(is_p1(as_p1(_Form, B), B), C),
    D=[quote, _Form],
    E=[_Name, C, D],
    [_n, _res, _qform]=E,
    (   _res=_List
    *-> F="\n     (MeTTa-Test \"{}\" {} \n        {} \n        {})",
        as_p1(_Form, G),
        as_p1(_passes, H),
        I=[_Name, G, _List, H],
        'mc_2__format-args'(F, I, J),
        'mc_1__println!'(J, K),
        L=is_p1(true, K),
        A=L
    ;   (   _res=M
        *-> N="\n     (MeTTa-Test \"{}\" {} \n       {} \n       {})",
            as_p1(_Form, O),
            P=[_Name, O, _List, _res],
            'mc_2__format-args'(N, P, Q),
            'mc_1__println!'(Q, R),
            S=is_p1(true, R),
            T=S
        ;   U='Empty',
            T=U
        ),
        A=T
    ).

</span>
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Should be Passing" (+ 1 1) (2) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Should be Passing" (+ 1 1) (2) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.01"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.01</h3>

     (MeTTa-Test "Should be Passing" 2 
        (2) 
        $passes)
; 
; EVAL TEST
; took 0.004 secs. (3.64 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Should be Passing" (+ 1 1) (2) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; returns of appropriate type
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Number" (Filter-Number (some-value)) (1 5) ($X 1 String () 5))
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Number" (Filter-Number (some-value)) (1 5) ($X 1 String () 5)) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.02"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.02</h3>

     (MeTTa-Test "Filter-Number" 1 
       (1 5) 
       (1))

     (MeTTa-Test "Filter-Number" a 
       (1 5) 
       ("a"))

     (MeTTa-Test "Filter-Number" c 
       (1 5) 
       ('c'))

     (MeTTa-Test "Filter-Number" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       (1 5) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-Number" 5 
       (1 5) 
       (5))

     (MeTTa-Test "Filter-Number" () 
       (1 5) 
       (()))

     (MeTTa-Test "Filter-Number" () 
       (1 5) 
       (()))

     (MeTTa-Test "Filter-Number" x: 1 y: 2 
       (1 5) 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-Number" S 
       (1 5) 
       (S))

     (MeTTa-Test "Filter-Number" Z 
       (1 5) 
       (Z))

     (MeTTa-Test "Filter-Number" (S Z) 
       (1 5) 
       ((S Z)))

     (MeTTa-Test "Filter-Number" String 
       (1 5) 
       (String))

     (MeTTa-Test "Filter-Number" (S (S Z)) 
       (1 5) 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.095 secs. (95.15 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Number" (Filter-Number (some-value)) (1 5) ($X 1 String () 5)) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; hyperon returns [1, String, (), 5]
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "passing" (+ 1 1) (2) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "passing" (+ 1 1) (2) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.03"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.03</h3>

     (MeTTa-Test "passing" 2 
        (2) 
        $passes)
; 
; EVAL TEST
; took 0.003 secs. (3.27 milliseconds) 

!(assertEqualToResult (MeTTa-Test "passing" (+ 1 1) (2) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span><span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-String" (Filter-String (some-value)) ("a" "x: 1 y: 2") $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-String" (Filter-String (some-value)) ("a" "x: 1 y: 2") $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.04"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.04</h3>

     (MeTTa-Test "Filter-String" 1 
       ("a" "x: 1 y: 2") 
       (1))

     (MeTTa-Test "Filter-String" a 
       ("a" "x: 1 y: 2") 
       ("a"))

     (MeTTa-Test "Filter-String" c 
       ("a" "x: 1 y: 2") 
       ('c'))

     (MeTTa-Test "Filter-String" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       ("a" "x: 1 y: 2") 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-String" 5 
       ("a" "x: 1 y: 2") 
       (5))

     (MeTTa-Test "Filter-String" () 
       ("a" "x: 1 y: 2") 
       (()))

     (MeTTa-Test "Filter-String" () 
       ("a" "x: 1 y: 2") 
       (()))

     (MeTTa-Test "Filter-String" x: 1 y: 2 
       ("a" "x: 1 y: 2") 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-String" S 
       ("a" "x: 1 y: 2") 
       (S))

     (MeTTa-Test "Filter-String" Z 
       ("a" "x: 1 y: 2") 
       (Z))

     (MeTTa-Test "Filter-String" (S Z) 
       ("a" "x: 1 y: 2") 
       ((S Z)))

     (MeTTa-Test "Filter-String" String 
       ("a" "x: 1 y: 2") 
       (String))

     (MeTTa-Test "Filter-String" (S (S Z)) 
       ("a" "x: 1 y: 2") 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.095 secs. (94.97 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-String" (Filter-String (some-value)) ("a" "x: 1 y: 2") $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; "a", String, "x: 1 y: 2", ()
;;;; Tests for Filter-Nat
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Nat" (Filter-Nat (some-value)) (Z (S Z) (S (S Z))) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Nat" (Filter-Nat (some-value)) (Z (S Z) (S (S Z))) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.05"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.05</h3>

     (MeTTa-Test "Filter-Nat" 1 
       (Z (S Z) (S (S Z))) 
       (1))

     (MeTTa-Test "Filter-Nat" a 
       (Z (S Z) (S (S Z))) 
       ("a"))

     (MeTTa-Test "Filter-Nat" c 
       (Z (S Z) (S (S Z))) 
       ('c'))

     (MeTTa-Test "Filter-Nat" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       (Z (S Z) (S (S Z))) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-Nat" 5 
       (Z (S Z) (S (S Z))) 
       (5))

     (MeTTa-Test "Filter-Nat" () 
       (Z (S Z) (S (S Z))) 
       (()))

     (MeTTa-Test "Filter-Nat" () 
       (Z (S Z) (S (S Z))) 
       (()))

     (MeTTa-Test "Filter-Nat" x: 1 y: 2 
       (Z (S Z) (S (S Z))) 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-Nat" S 
       (Z (S Z) (S (S Z))) 
       (S))

     (MeTTa-Test "Filter-Nat" Z 
       (Z (S Z) (S (S Z))) 
       (Z))

     (MeTTa-Test "Filter-Nat" (S Z) 
       (Z (S Z) (S (S Z))) 
       ((S Z)))

     (MeTTa-Test "Filter-Nat" String 
       (Z (S Z) (S (S Z))) 
       (String))

     (MeTTa-Test "Filter-Nat" (S (S Z)) 
       (Z (S Z) (S (S Z))) 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.159 secs. (158.81 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Nat" (Filter-Nat (some-value)) (Z (S Z) (S (S Z))) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-Symbol
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Symbol" (Filter-Symbol (some-value)) (S &self) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Symbol" (Filter-Symbol (some-value)) (S &self) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.06"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.06</h3>

     (MeTTa-Test "Filter-Symbol" 1 
       (S &self) 
       (1))

     (MeTTa-Test "Filter-Symbol" a 
       (S &self) 
       ("a"))

     (MeTTa-Test "Filter-Symbol" c 
       (S &self) 
       ('c'))

     (MeTTa-Test "Filter-Symbol" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       (S &self) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-Symbol" 5 
       (S &self) 
       (5))

     (MeTTa-Test "Filter-Symbol" () 
       (S &self) 
       (()))

     (MeTTa-Test "Filter-Symbol" () 
       (S &self) 
       (()))

     (MeTTa-Test "Filter-Symbol" x: 1 y: 2 
       (S &self) 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-Symbol" S 
       (S &self) 
       (S))

     (MeTTa-Test "Filter-Symbol" Z 
       (S &self) 
       (Z))

     (MeTTa-Test "Filter-Symbol" (S Z) 
       (S &self) 
       ((S Z)))

     (MeTTa-Test "Filter-Symbol" String 
       (S &self) 
       (String))

     (MeTTa-Test "Filter-Symbol" (S (S Z)) 
       (S &self) 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.097 secs. (97.39 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Symbol" (Filter-Symbol (some-value)) (S &self) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-Variable
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Variable" (Filter-Variable (some-value)) (&self) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Variable" (Filter-Variable (some-value)) (&self) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.07"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.07</h3>

     (MeTTa-Test "Filter-Variable" 1 
       (&self) 
       (1))

     (MeTTa-Test "Filter-Variable" a 
       (&self) 
       ("a"))

     (MeTTa-Test "Filter-Variable" c 
       (&self) 
       ('c'))

     (MeTTa-Test "Filter-Variable" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       (&self) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-Variable" 5 
       (&self) 
       (5))

     (MeTTa-Test "Filter-Variable" () 
       (&self) 
       (()))

     (MeTTa-Test "Filter-Variable" () 
       (&self) 
       (()))

     (MeTTa-Test "Filter-Variable" x: 1 y: 2 
       (&self) 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-Variable" S 
       (&self) 
       (S))

     (MeTTa-Test "Filter-Variable" Z 
       (&self) 
       (Z))

     (MeTTa-Test "Filter-Variable" (S Z) 
       (&self) 
       ((S Z)))

     (MeTTa-Test "Filter-Variable" String 
       (&self) 
       (String))

     (MeTTa-Test "Filter-Variable" (S (S Z)) 
       (&self) 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.095 secs. (95.30 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Variable" (Filter-Variable (some-value)) (&self) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Example case
;;;; Tests for Filter-Grounded
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Grounded" (Filter-Grounded (some-value)) (1 "a" 'c' Z (S Z)) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Grounded" (Filter-Grounded (some-value)) (1 "a" 'c' Z (S Z)) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.08"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.08</h3>

     (MeTTa-Test "Filter-Grounded" 1 
       (1 "a" 'c' Z (S Z)) 
       (1))

     (MeTTa-Test "Filter-Grounded" a 
       (1 "a" 'c' Z (S Z)) 
       ("a"))

     (MeTTa-Test "Filter-Grounded" c 
       (1 "a" 'c' Z (S Z)) 
       ('c'))

     (MeTTa-Test "Filter-Grounded" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       (1 "a" 'c' Z (S Z)) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-Grounded" 5 
       (1 "a" 'c' Z (S Z)) 
       (5))

     (MeTTa-Test "Filter-Grounded" () 
       (1 "a" 'c' Z (S Z)) 
       (()))

     (MeTTa-Test "Filter-Grounded" () 
       (1 "a" 'c' Z (S Z)) 
       (()))

     (MeTTa-Test "Filter-Grounded" x: 1 y: 2 
       (1 "a" 'c' Z (S Z)) 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-Grounded" S 
       (1 "a" 'c' Z (S Z)) 
       (S))

     (MeTTa-Test "Filter-Grounded" Z 
       (1 "a" 'c' Z (S Z)) 
       (Z))

     (MeTTa-Test "Filter-Grounded" (S Z) 
       (1 "a" 'c' Z (S Z)) 
       ((S Z)))

     (MeTTa-Test "Filter-Grounded" String 
       (1 "a" 'c' Z (S Z)) 
       (String))

     (MeTTa-Test "Filter-Grounded" (S (S Z)) 
       (1 "a" 'c' Z (S Z)) 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.131 secs. (130.79 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Grounded" (Filter-Grounded (some-value)) (1 "a" 'c' Z (S Z)) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-Type
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Type" (Filter-Type (some-value)) (String) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Type" (Filter-Type (some-value)) (String) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.09"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.09</h3>

     (MeTTa-Test "Filter-Type" 1 
       (String) 
       (1))

     (MeTTa-Test "Filter-Type" a 
       (String) 
       ("a"))

     (MeTTa-Test "Filter-Type" c 
       (String) 
       ('c'))

     (MeTTa-Test "Filter-Type" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       (String) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-Type" 5 
       (String) 
       (5))

     (MeTTa-Test "Filter-Type" () 
       (String) 
       (()))

     (MeTTa-Test "Filter-Type" () 
       (String) 
       (()))

     (MeTTa-Test "Filter-Type" x: 1 y: 2 
       (String) 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-Type" S 
       (String) 
       (S))

     (MeTTa-Test "Filter-Type" Z 
       (String) 
       (Z))

     (MeTTa-Test "Filter-Type" (S Z) 
       (String) 
       ((S Z)))

     (MeTTa-Test "Filter-Type" String 
        (String) 
        $passes)

     (MeTTa-Test "Filter-Type" (S (S Z)) 
       (String) 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.094 secs. (94.06 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Type" (Filter-Type (some-value)) (String) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-%Undefined%
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-%Undefined%" (Filter-%Undefined% (some-value)) (all the values) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-%Undefined%" (Filter-%Undefined% (some-value)) (all the values) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.10"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.10</h3>

     (MeTTa-Test "Filter-%Undefined%" 1 
       (all the values) 
       (1))

     (MeTTa-Test "Filter-%Undefined%" a 
       (all the values) 
       ("a"))

     (MeTTa-Test "Filter-%Undefined%" c 
       (all the values) 
       ('c'))

     (MeTTa-Test "Filter-%Undefined%" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       (all the values) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-%Undefined%" 5 
       (all the values) 
       (5))

     (MeTTa-Test "Filter-%Undefined%" () 
       (all the values) 
       (()))

     (MeTTa-Test "Filter-%Undefined%" () 
       (all the values) 
       (()))

     (MeTTa-Test "Filter-%Undefined%" x: 1 y: 2 
       (all the values) 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-%Undefined%" S 
       (all the values) 
       (S))

     (MeTTa-Test "Filter-%Undefined%" Z 
       (all the values) 
       (Z))

     (MeTTa-Test "Filter-%Undefined%" (S Z) 
       (all the values) 
       ((S Z)))

     (MeTTa-Test "Filter-%Undefined%" String 
       (all the values) 
       (String))

     (MeTTa-Test "Filter-%Undefined%" (S (S Z)) 
       (all the values) 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.100 secs. (99.60 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-%Undefined%" (Filter-%Undefined% (some-value)) (all the values) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-TVar
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-TVar" (Filter-TVar (some-value)) (1 "a" Z (S Z) (S (S Z))) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-TVar" (Filter-TVar (some-value)) (1 "a" Z (S Z) (S (S Z))) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.11"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.11</h3>

     (MeTTa-Test "Filter-TVar" 1 
       (1 "a" Z (S Z) (S (S Z))) 
       (1))

     (MeTTa-Test "Filter-TVar" a 
       (1 "a" Z (S Z) (S (S Z))) 
       ("a"))

     (MeTTa-Test "Filter-TVar" c 
       (1 "a" Z (S Z) (S (S Z))) 
       ('c'))

     (MeTTa-Test "Filter-TVar" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       (1 "a" Z (S Z) (S (S Z))) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-TVar" 5 
       (1 "a" Z (S Z) (S (S Z))) 
       (5))

     (MeTTa-Test "Filter-TVar" () 
       (1 "a" Z (S Z) (S (S Z))) 
       (()))

     (MeTTa-Test "Filter-TVar" () 
       (1 "a" Z (S Z) (S (S Z))) 
       (()))

     (MeTTa-Test "Filter-TVar" x: 1 y: 2 
       (1 "a" Z (S Z) (S (S Z))) 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-TVar" S 
       (1 "a" Z (S Z) (S (S Z))) 
       (S))

     (MeTTa-Test "Filter-TVar" Z 
       (1 "a" Z (S Z) (S (S Z))) 
       (Z))

     (MeTTa-Test "Filter-TVar" (S Z) 
       (1 "a" Z (S Z) (S (S Z))) 
       ((S Z)))

     (MeTTa-Test "Filter-TVar" String 
       (1 "a" Z (S Z) (S (S Z))) 
       (String))

     (MeTTa-Test "Filter-TVar" (S (S Z)) 
       (1 "a" Z (S Z) (S (S Z))) 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.171 secs. (171.38 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-TVar" (Filter-TVar (some-value)) (1 "a" Z (S Z) (S (S Z))) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-Undeclared
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Undeclared" (Filter-Undeclared (some-value)) () $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Undeclared" (Filter-Undeclared (some-value)) () $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.12"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.12</h3>

     (MeTTa-Test "Filter-Undeclared" 1 
       () 
       (1))

     (MeTTa-Test "Filter-Undeclared" a 
       () 
       ("a"))

     (MeTTa-Test "Filter-Undeclared" c 
       () 
       ('c'))

     (MeTTa-Test "Filter-Undeclared" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       () 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-Undeclared" 5 
       () 
       (5))

     (MeTTa-Test "Filter-Undeclared" () 
       () 
       (()))

     (MeTTa-Test "Filter-Undeclared" () 
       () 
       (()))

     (MeTTa-Test "Filter-Undeclared" x: 1 y: 2 
       () 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-Undeclared" S 
       () 
       (S))

     (MeTTa-Test "Filter-Undeclared" Z 
       () 
       (Z))

     (MeTTa-Test "Filter-Undeclared" (S Z) 
       () 
       ((S Z)))

     (MeTTa-Test "Filter-Undeclared" String 
       () 
       (String))

     (MeTTa-Test "Filter-Undeclared" (S (S Z)) 
       () 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.075 secs. (75.33 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Undeclared" (Filter-Undeclared (some-value)) () $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-Expression
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Expression" (Filter-Expression (some-value)) ((+ 2 3) (format-args "x: {} y: {}" (1 2))) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Expression" (Filter-Expression (some-value)) ((+ 2 3) (format-args "x: {} y: {}" (1 2))) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.13"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.13</h3>

     (MeTTa-Test "Filter-Expression" 1 
       (5 "x: 1 y: 2") 
       (1))

     (MeTTa-Test "Filter-Expression" a 
       (5 "x: 1 y: 2") 
       ("a"))

     (MeTTa-Test "Filter-Expression" c 
       (5 "x: 1 y: 2") 
       ('c'))

     (MeTTa-Test "Filter-Expression" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       (5 "x: 1 y: 2") 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-Expression" 5 
       (5 "x: 1 y: 2") 
       (5))

     (MeTTa-Test "Filter-Expression" () 
       (5 "x: 1 y: 2") 
       (()))

     (MeTTa-Test "Filter-Expression" () 
       (5 "x: 1 y: 2") 
       (()))

     (MeTTa-Test "Filter-Expression" x: 1 y: 2 
       (5 "x: 1 y: 2") 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-Expression" S 
       (5 "x: 1 y: 2") 
       (S))

     (MeTTa-Test "Filter-Expression" Z 
       (5 "x: 1 y: 2") 
       (Z))

     (MeTTa-Test "Filter-Expression" (S Z) 
       (5 "x: 1 y: 2") 
       ((S Z)))

     (MeTTa-Test "Filter-Expression" String 
       (5 "x: 1 y: 2") 
       (String))

     (MeTTa-Test "Filter-Expression" (S (S Z)) 
       (5 "x: 1 y: 2") 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.101 secs. (100.89 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Expression" (Filter-Expression (some-value)) ((+ 2 3) (format-args "x: {} y: {}" (1 2))) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-Atom
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Atom" (Filter-Atom (some-value)) (1 "a" 'c' S Z (S Z)) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Atom" (Filter-Atom (some-value)) (1 "a" 'c' S Z (S Z)) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.14"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.14</h3>

     (MeTTa-Test "Filter-Atom" 1 
       (1 "a" 'c' S Z (S Z)) 
       (1))

     (MeTTa-Test "Filter-Atom" a 
       (1 "a" 'c' S Z (S Z)) 
       ("a"))

     (MeTTa-Test "Filter-Atom" c 
       (1 "a" 'c' S Z (S Z)) 
       ('c'))

     (MeTTa-Test "Filter-Atom" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       (1 "a" 'c' S Z (S Z)) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-Atom" 5 
       (1 "a" 'c' S Z (S Z)) 
       (5))

     (MeTTa-Test "Filter-Atom" () 
       (1 "a" 'c' S Z (S Z)) 
       (()))

     (MeTTa-Test "Filter-Atom" () 
       (1 "a" 'c' S Z (S Z)) 
       (()))

     (MeTTa-Test "Filter-Atom" x: 1 y: 2 
       (1 "a" 'c' S Z (S Z)) 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-Atom" S 
       (1 "a" 'c' S Z (S Z)) 
       (S))

     (MeTTa-Test "Filter-Atom" Z 
       (1 "a" 'c' S Z (S Z)) 
       (Z))

     (MeTTa-Test "Filter-Atom" (S Z) 
       (1 "a" 'c' S Z (S Z)) 
       ((S Z)))

     (MeTTa-Test "Filter-Atom" String 
       (1 "a" 'c' S Z (S Z)) 
       (String))

     (MeTTa-Test "Filter-Atom" (S (S Z)) 
       (1 "a" 'c' S Z (S Z)) 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.131 secs. (130.95 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Atom" (Filter-Atom (some-value)) (1 "a" 'c' S Z (S Z)) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-ExpressionNumber
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-ExpressionNumber" (Filter-ExpressionNumber (some-value)) ((+ 2 3)) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-ExpressionNumber" (Filter-ExpressionNumber (some-value)) ((+ 2 3)) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.15"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.15</h3>

     (MeTTa-Test "Filter-ExpressionNumber" 1 
       (5) 
       (1))

     (MeTTa-Test "Filter-ExpressionNumber" a 
       (5) 
       ("a"))

     (MeTTa-Test "Filter-ExpressionNumber" c 
       (5) 
       ('c'))

     (MeTTa-Test "Filter-ExpressionNumber" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       (5) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-ExpressionNumber" 5 
        (5) 
        $passes)

     (MeTTa-Test "Filter-ExpressionNumber" () 
       (5) 
       (()))

     (MeTTa-Test "Filter-ExpressionNumber" () 
       (5) 
       (()))

     (MeTTa-Test "Filter-ExpressionNumber" x: 1 y: 2 
       (5) 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-ExpressionNumber" S 
       (5) 
       (S))

     (MeTTa-Test "Filter-ExpressionNumber" Z 
       (5) 
       (Z))

     (MeTTa-Test "Filter-ExpressionNumber" (S Z) 
       (5) 
       ((S Z)))

     (MeTTa-Test "Filter-ExpressionNumber" String 
       (5) 
       (String))

     (MeTTa-Test "Filter-ExpressionNumber" (S (S Z)) 
       (5) 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.095 secs. (94.57 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-ExpressionNumber" (Filter-ExpressionNumber (some-value)) ((+ 2 3)) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-ExpressionUnit
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-ExpressionUnit" (Filter-ExpressionUnit (some-value)) (empty (println! "did it")) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-ExpressionUnit" (Filter-ExpressionUnit (some-value)) (empty (println! "did it")) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.16"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.16</h3>
did it

     (MeTTa-Test "Filter-ExpressionUnit" 1 
       (empty ()) 
       (1))
did it

     (MeTTa-Test "Filter-ExpressionUnit" a 
       (empty ()) 
       ("a"))
did it

     (MeTTa-Test "Filter-ExpressionUnit" c 
       (empty ()) 
       ('c'))
did it

     (MeTTa-Test "Filter-ExpressionUnit" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       (empty ()) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))
did it

     (MeTTa-Test "Filter-ExpressionUnit" 5 
       (empty ()) 
       (5))
did it

     (MeTTa-Test "Filter-ExpressionUnit" () 
       (empty ()) 
       (()))
did it
did it

     (MeTTa-Test "Filter-ExpressionUnit" () 
       (empty ()) 
       (()))
did it

     (MeTTa-Test "Filter-ExpressionUnit" x: 1 y: 2 
       (empty ()) 
       ("x: 1 y: 2"))
did it

     (MeTTa-Test "Filter-ExpressionUnit" S 
       (empty ()) 
       (S))
did it

     (MeTTa-Test "Filter-ExpressionUnit" Z 
       (empty ()) 
       (Z))
did it

     (MeTTa-Test "Filter-ExpressionUnit" (S Z) 
       (empty ()) 
       ((S Z)))
did it

     (MeTTa-Test "Filter-ExpressionUnit" String 
       (empty ()) 
       (String))
did it

     (MeTTa-Test "Filter-ExpressionUnit" (S (S Z)) 
       (empty ()) 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.101 secs. (100.62 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-ExpressionUnit" (Filter-ExpressionUnit (some-value)) (empty (println! "did it")) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-ExpressionAtom
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-ExpressionAtom" (Filter-ExpressionAtom (some-value)) () $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-ExpressionAtom" (Filter-ExpressionAtom (some-value)) () $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.17"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.17</h3>

     (MeTTa-Test "Filter-ExpressionAtom" 1 
       () 
       (1))

     (MeTTa-Test "Filter-ExpressionAtom" a 
       () 
       ("a"))

     (MeTTa-Test "Filter-ExpressionAtom" c 
       () 
       ('c'))

     (MeTTa-Test "Filter-ExpressionAtom" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       () 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-ExpressionAtom" 5 
       () 
       (5))

     (MeTTa-Test "Filter-ExpressionAtom" () 
       () 
       (()))

     (MeTTa-Test "Filter-ExpressionAtom" () 
       () 
       (()))

     (MeTTa-Test "Filter-ExpressionAtom" x: 1 y: 2 
       () 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-ExpressionAtom" S 
       () 
       (S))

     (MeTTa-Test "Filter-ExpressionAtom" Z 
       () 
       (Z))

     (MeTTa-Test "Filter-ExpressionAtom" (S Z) 
       () 
       ((S Z)))

     (MeTTa-Test "Filter-ExpressionAtom" String 
       () 
       (String))

     (MeTTa-Test "Filter-ExpressionAtom" (S (S Z)) 
       () 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.074 secs. (74.01 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-ExpressionAtom" (Filter-ExpressionAtom (some-value)) () $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-AtomAtom
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-AtomAtom" (Filter-AtomAtom (some-value)) (Z String "a" 1 'c' $X S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-AtomAtom" (Filter-AtomAtom (some-value)) (Z String "a" 1 'c' $X S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.18"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.18</h3>

     (MeTTa-Test "Filter-AtomAtom" 1 
       (Z String "a" 1 'c' $X S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) 
       (1))

     (MeTTa-Test "Filter-AtomAtom" a 
       (Z String "a" 1 'c' $X S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) 
       ("a"))

     (MeTTa-Test "Filter-AtomAtom" c 
       (Z String "a" 1 'c' $X S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) 
       ('c'))

     (MeTTa-Test "Filter-AtomAtom" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       (Z String "a" 1 'c' $X S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-AtomAtom" 5 
       (Z String "a" 1 'c' $X S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) 
       (5))

     (MeTTa-Test "Filter-AtomAtom" () 
       (Z String "a" 1 'c' $X S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) 
       (()))

     (MeTTa-Test "Filter-AtomAtom" () 
       (Z String "a" 1 'c' $X S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) 
       (()))

     (MeTTa-Test "Filter-AtomAtom" x: 1 y: 2 
       (Z String "a" 1 'c' $X S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-AtomAtom" S 
       (Z String "a" 1 'c' $X S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) 
       (S))

     (MeTTa-Test "Filter-AtomAtom" Z 
       (Z String "a" 1 'c' $X S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) 
       (Z))

     (MeTTa-Test "Filter-AtomAtom" (S Z) 
       (Z String "a" 1 'c' $X S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) 
       ((S Z)))

     (MeTTa-Test "Filter-AtomAtom" String 
       (Z String "a" 1 'c' $X S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) 
       (String))

     (MeTTa-Test "Filter-AtomAtom" (S (S Z)) 
       (Z String "a" 1 'c' $X S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.295 secs. (294.61 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-AtomAtom" (Filter-AtomAtom (some-value)) (Z String "a" 1 'c' $X S (Cons 1 (Cons 2 (Cons 3 Nil))) () 5 (S Z) "x: 1 y: 2" (S (S Z)) ()) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-Char
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Char" (Filter-Char (some-value)) ('c') $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Char" (Filter-Char (some-value)) ('c') $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.19"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.19</h3>

     (MeTTa-Test "Filter-Char" 1 
       ('c') 
       (1))

     (MeTTa-Test "Filter-Char" a 
       ('c') 
       ("a"))

     (MeTTa-Test "Filter-Char" c 
        ('c') 
        $passes)

     (MeTTa-Test "Filter-Char" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       ('c') 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))

     (MeTTa-Test "Filter-Char" 5 
       ('c') 
       (5))

     (MeTTa-Test "Filter-Char" () 
       ('c') 
       (()))

     (MeTTa-Test "Filter-Char" () 
       ('c') 
       (()))

     (MeTTa-Test "Filter-Char" x: 1 y: 2 
       ('c') 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-Char" S 
       ('c') 
       (S))

     (MeTTa-Test "Filter-Char" Z 
       ('c') 
       (Z))

     (MeTTa-Test "Filter-Char" (S Z) 
       ('c') 
       ((S Z)))

     (MeTTa-Test "Filter-Char" String 
       ('c') 
       (String))

     (MeTTa-Test "Filter-Char" (S (S Z)) 
       ('c') 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.104 secs. (103.71 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Char" (Filter-Char (some-value)) ('c') $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-Empty
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-Empty" (Filter-Empty (some-value)) (empty (println! "did it") ()) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-Empty" (Filter-Empty (some-value)) (empty (println! "did it") ()) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.20"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.20</h3>
did it

     (MeTTa-Test "Filter-Empty" 1 
       (empty () ()) 
       (1))
did it

     (MeTTa-Test "Filter-Empty" a 
       (empty () ()) 
       ("a"))
did it

     (MeTTa-Test "Filter-Empty" c 
       (empty () ()) 
       ('c'))
did it

     (MeTTa-Test "Filter-Empty" (Cons 1 (Cons 2 (Cons 3 Nil))) 
       (empty () ()) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))))
did it

     (MeTTa-Test "Filter-Empty" 5 
       (empty () ()) 
       (5))
did it

     (MeTTa-Test "Filter-Empty" () 
       (empty () ()) 
       (()))
did it
did it

     (MeTTa-Test "Filter-Empty" () 
       (empty () ()) 
       (()))
did it

     (MeTTa-Test "Filter-Empty" x: 1 y: 2 
       (empty () ()) 
       ("x: 1 y: 2"))
did it

     (MeTTa-Test "Filter-Empty" S 
       (empty () ()) 
       (S))
did it

     (MeTTa-Test "Filter-Empty" Z 
       (empty () ()) 
       (Z))
did it

     (MeTTa-Test "Filter-Empty" (S Z) 
       (empty () ()) 
       ((S Z)))
did it

     (MeTTa-Test "Filter-Empty" String 
       (empty () ()) 
       (String))
did it

     (MeTTa-Test "Filter-Empty" (S (S Z)) 
       (empty () ()) 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.100 secs. (99.70 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-Empty" (Filter-Empty (some-value)) (empty (println! "did it") ()) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>;;;; Tests for Filter-List
<span class="ansi38-255165009"
>;; In file as:  
</span><span class="ansi1 ansi38-255238088"
>!(MeTTa-Test "Filter-List" (Filter-List (some-value)) ((Cons 1 (Cons 2 (Cons 3 Nil)))) $passes)
</span>;; To unit test case:
<span class="ansi38-013099040"
>!(assertEqualToResult (MeTTa-Test "Filter-List" (Filter-List (some-value)) ((Cons 1 (Cons 2 (Cons 3 Nil)))) $passes) (()))

</span>
;<h3 id="HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.21"
>;; HYPERON-METTALOG-SANITY.TYPE-FILTERING-TESTS.21</h3>

     (MeTTa-Test "Filter-List" 1 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))) 
       (1))

     (MeTTa-Test "Filter-List" a 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))) 
       ("a"))

     (MeTTa-Test "Filter-List" c 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))) 
       ('c'))

     (MeTTa-Test "Filter-List" (Cons 1 (Cons 2 (Cons 3 Nil))) 
        ((Cons 1 (Cons 2 (Cons 3 Nil)))) 
        $passes)

     (MeTTa-Test "Filter-List" 5 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))) 
       (5))

     (MeTTa-Test "Filter-List" () 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))) 
       (()))

     (MeTTa-Test "Filter-List" () 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))) 
       (()))

     (MeTTa-Test "Filter-List" x: 1 y: 2 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))) 
       ("x: 1 y: 2"))

     (MeTTa-Test "Filter-List" S 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))) 
       (S))

     (MeTTa-Test "Filter-List" Z 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))) 
       (Z))

     (MeTTa-Test "Filter-List" (S Z) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))) 
       ((S Z)))

     (MeTTa-Test "Filter-List" String 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))) 
       (String))

     (MeTTa-Test "Filter-List" (S (S Z)) 
       ((Cons 1 (Cons 2 (Cons 3 Nil)))) 
       ((S (S Z))))
; 
; EVAL TEST
; took 0.153 secs. (152.72 milliseconds) 

!(assertEqualToResult (MeTTa-Test "Filter-List" (Filter-List (some-value)) ((Cons 1 (Cons 2 (Cons 3 Nil)))) $passes) (()))

<span class="ansi36"
>  #(loonit_success 
    #(equal_enough_for_test 
      (() () () () () () () () () () () () ()) 
      (())))
</span>
Deterministic: <span class="ansi33"
>()
</span>P;HTML|
;                #( = /home/runner/work/metta-testsuite/metta-testsuite/tests/baseline_compat/hyperon-mettalog_sanity/type_filtering_tests.metta 0 )
<span class="ansi1"
>LoonIt Report
</span>------------
<span class="ansi32"
>Successes: 21
</span><span class="ansi32"
>Failures: 0
</span><br/> <a href="#" onclick="window.history.back(); return false;"
>Return to summaries</a><br/>
P;HTML|
;          #(set_debug transpiler false)
P;HTML|
;          #(set_debug overtime 4.0)
P;HTML|
;          #(set_debug overflow 1000)
P;HTML|
;          #(set_debug eval false)
P;HTML|
;          #(set_debug load silent)
P;HTML|
;          #(set_debug trace-on-load false)
P;HTML|
;          #(set_debug exec false)
P;HTML|
;          #(set_debug error non-type)
P;HTML|
;          #(set_debug fail false)
P;HTML|
;          #(set_debug test true)
P;HTML|
;          #(set_debug test false)
P;HTML|
;          #(set_debug fail false)
[()]
[()]
[()]
[()]
[()]
[()]
[()]
[()]
[()]
[()]
[()]
[()]
[()]
[()]
[()]
[()]
[()]
[()]
[()]
[()]
[()]
P;HTML|
;           #(maybe_halt 7)
<span class="ansi31"
>#(in #(not_compat_io #(maybe_halt 7)) #(unwind #(halt 7)))
</span>
Script done on 2024-12-26 10:53:12+00:00 [COMMAND_EXIT_CODE="7"]

</pre>
</body>

</html>
\033[0;32mCompleted successfully (EXITCODE=7) Under 40 seconds: ./mettalog '--output=./reports/tests_output/baseline-compat/' --timeout=40 --html --repl=false  --test "tests/baseline_compat/hyperon-mettalog_sanity/type_filtering_tests.metta" --halt=true\033[0m
